{
  "From: a..shankman@enron.com": {
    "test_samples": [
      [
        "Please take a look at what's going on.",
        "take a look please."
      ],
      [
        "Jeff, I'll start laying the groundwork.",
        "thanks Rob. I'll go start laying the groundwork. Jeff"
      ],
      [
        "I told Ron Slimp that I would take him over Scott T any day.",
        "I talked to Ron Slimp yesterday about his interests. As a piece of info, I'd take Ron over Scott T anyday. Jeff"
      ],
      [
        "Put it in the rolodex.",
        "put in rolodex"
      ],
      [
        "Is this in the rolodex?",
        "is this in the rolodex"
      ]
    ],
    "val_samples": [
      [
        "I would encourage you to attend the all employee meeting today at 10:00, as there is an investor call at 8:30 that you should listen to.",
        "There is an investor call at 8:30, which you should listen to. Also, I'd encourage you all to listen to or go to the all employee meeting today at 10. Jeff"
      ],
      [
        "I have a list of customers as well as MTM for each of them.",
        "Customer list as requested. I also have MTM for each customer in a different file--to follow. Let's grab lunch sometime. Jeff"
      ],
      [
        "Please look at what's going on.",
        "please look."
      ],
      [
        "I'm not sure what to say.",
        "FYI"
      ],
      [
        "I'm confused as to whether or not anyone is in the office at that time.",
        "yes, but no one is in the office at that time. I'm confused."
      ]
    ],
    "target": [
      "From: david.parquet@enron.com",
      "From: john.forney@enron.com",
      "From: sylvia.hu@enron.com",
      "From: paula.rieker@enron.com",
      "From: rhonda.denton@enron.com"
    ]
  },
  "From: aleck.dadson@enron.com": {
    "test_samples": [
      [
        "The gov't's four guiding principles are wrong because they include protecting consumers, creating a stable business climate, protecting the environment, and promoting new ways of doing business and alternative sources of energy.",
        "FYI - Though Mitch has the gov't's 4 guiding principles wrong. They are: protecting consumers, creating a stable business climate, protecting the environment, and promoting new ways of doing business and alternative sources of energy."
      ],
      [
        "I don't know if you got Glenn's feed back from the earlier drafts of the Q&A document.",
        "Attached is the final draft of the Q&A document we have been working on. I am uncertain whether you had a chance to get Glenn Leslie's feed back, if any, on the earlier drafts."
      ],
      [
        "Is this okay with you, thanks, Aleck.",
        "Is this okay with you. Thanks, Aleck"
      ],
      [
        "It's very important.",
        "FYI"
      ],
      [
        "The BE contract has been extended.",
        "FYI - BE contract extended."
      ]
    ],
    "val_samples": [
      [
        "The bars in the GANTT chart end on March 1, 2002, so that appears as the market opening date in the new market readiness plan.",
        "The new market readiness plan appears to target March 1, 2002 as the market opening date. I say \"appears\" because the bars in the GANTT chart end on that date."
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "The memo summarizes where things stand after the announcement of the Ontario market opening on April 23rd.",
        "Attached is a memo summarizing where matters stand re Ontario market opening after the announcement on April 23rd."
      ],
      [
        "I think it's important.",
        "FYI"
      ],
      [
        "The Progressive Conservative Party has an Advisory Committee on Energy.",
        "FYI- PACE is the Progressive Conservative Party Advisory Committee on Energy."
      ]
    ],
    "target": [
      "From: zakiyyah.mcclure@enron.com",
      "From: paul.cherry@enron.com",
      "From: taffy.milligan@enron.com",
      "From: houston",
      "From: lorna.brennan@enron.com"
    ]
  },
  "From: allison.navin@enron.com": {
    "test_samples": [
      [
        "The attached report is on Horizontal Market Power in Restructured Electricity Markets.",
        "Please see the attached DOE report on Horizontal Market Power in Restructured Electricity Markets. Thanks."
      ],
      [
        "If you would like to speak to Dr. Crandall at your earliest convenience, her number is 202-685-4319.",
        "Jeff - Would you mind giving Dr. Crandall a call at your earliest convenience? Her number is 202-685-4319. Thanks."
      ]
    ],
    "val_samples": [
      [
        "There is a list of House Commerce Committee members.",
        "A list of the House Commerce Committee members is attached."
      ],
      [
        "Here is a section-by-section summary of the energy bill that was introduced this morning.",
        "Here is the Murkowski energy bill that was introduced this morning, along with a section-by-section summary."
      ]
    ],
    "target": [
      "From: jennifer.thome@enron.com",
      "From: george.mcclellan@enron.com",
      "From: gramlr@pjm.com",
      "From: nony.flores@enron.com",
      "From: susan.mara@enron.com"
    ]
  },
  "From: amanda.rybarski@enron.com": {
    "test_samples": [
      [
        "Is it a black lab?",
        "Black Lab?"
      ],
      [
        "I thought you'd like it.",
        "I figured you would like it!"
      ],
      [
        "Where are we going?",
        "so where are we going to go?"
      ],
      [
        "I'm ready to do anything at any time.",
        "and I'm ready to anytime"
      ],
      [
        "I will let you know when you're able to get in, it should be by this afternoon.",
        "I am working on getting everyone access as we speak. I will let you know when you can get in. It should be by this afternoon the latest. Thanks, Amanda"
      ]
    ],
    "val_samples": [
      [
        "I can't wait!",
        "Yes! Believe me, I can't wait!"
      ],
      [
        "I got a new hair style.",
        "I got a new haircut!"
      ],
      [
        "I can tell that you didn't miss me.",
        "So you didn't miss me...I can tell"
      ],
      [
        "You are also as much of a part of this as you are.",
        "you too"
      ],
      [
        "I'm not sure when you're getting your haircut.",
        "I don't know...when are you getting your haircut?"
      ]
    ],
    "target": [
      "From: anne.bike@enron.com",
      "From: kim.theriot@enron.com",
      "From: donna.teal@enron.com",
      "From: bradley.diebner@enron.com",
      "From: paul.cherry@enron.com"
    ]
  },
  "From: amy.copeland@enron.com": {
    "test_samples": [
      [
        "If you have questions, please give me a call, as I have attached the 2000 Weekly Cost reports for the week ending April 28th.",
        "Attached are the 2000 Weekly Cost reports for the week ending April 28th. If you have any questions, please give me a call. Thanks Amy Spoede (formerly Copeland) 3-7805"
      ],
      [
        "I will be happy to give you a call if you have any questions.",
        "Attached are the 2000 Weekly Cost Summary reports for the week ending 3/3/00. If you have any questions, please give me a call. Thanks Amy 3-7805"
      ]
    ],
    "val_samples": [
      [
        "Attached is the 2000 weekly cost summary for activity through the month of January. If you have any questions, please give me a call.",
        "Attached please find the 2000 Weekly Cost Summary for activity through 3/17/00. If you have any questions, please give me a call. Thanks Amy 3-7805"
      ],
      [
        "If you have any questions, please call, Attached are the cost reports for the week ending 4/7/00, if you have any questions, please call.",
        "Attached are the weekly cost reports for the week ending 4/7/00. If you have any questions please call. Thanks Amy 3-7805"
      ]
    ],
    "target": [
      "From: exchange.administrator@enron.com",
      "From: richard.hrabal@enron.com",
      "From: anne.bike@enron.com",
      "From: larry.may@enron.com",
      "From: steven@iepa.com"
    ]
  },
  "From: amy.fitzpatrick@enron.com": {
    "test_samples": [
      [
        "I will forward you the converstion form in a separate e-mail, but please see the notes below.",
        "Kevin - Please see notes below regarding your life insurance. I will be forwarding you the converstion form in a separate e-mail. Amy"
      ],
      [
        "Louise spoke to the other person, Greg, and they advised Cecil, Stephen and Lydia not to come in.",
        "Louise - Spoke with Marla Barnard (she and Greg spoke this morning) - they have contacted Cecil, Stephen and Lydia and advised not to come in. Regards - Amy"
      ],
      [
        "Thanks Amy... Thanks Craig...",
        "Thanks Craig.... Amy"
      ],
      [
        "Please return your feedback to me as soon as possible if you have already done so.",
        "Good morning! If you have done so already, can you please return your feedback to me ASAP? Thanks! Amy"
      ],
      [
        "You can make a left from Heather's direction. Hope to see you there!",
        "The ???? from Heather is to make a left onto Huber. Hope to see you there! Amy"
      ]
    ],
    "val_samples": [
      [
        "I should be free in about an hour or two, but I am still in the middle of announcing some details.",
        "Absolutely......I am in the middle of confirming some details, but should be free in about an hour or so..... Is this OK? A"
      ],
      [
        "I would like to know if you have any interest in this candidate.",
        "Vince - Would you have any interest in this candidate? Kind regards - Amy"
      ],
      [
        "We're expecting him over 3 hours ago but Kevin and Dave are still waiting, so can you tell me the status?",
        "We were expecting his over 3 hours ago and Kevin Presto/Dave Ryan are waiting. Can you please advise the status? I don't seem to be able to reach either you or Jenai by phone. Thanks - Amy"
      ],
      [
        "We haven't heard anything about the Enron matters, it's been very busy, so we have been out of the loop.",
        "I really haven't heard anything.. we have been so out of the loop on Enron matters (conflict of interest and just really busy!!). A"
      ],
      [
        "I'm sorry, but I'm very glad to hear that you're back!",
        "Sorry to hear that - but very glad to hear that you are back!"
      ]
    ],
    "target": [
      "From: zakiyyah.mcclure@enron.com",
      "From: linda.noske@enron.com",
      "From: donna.teal@enron.com",
      "From: brandee.jackson@enron.com",
      "From: mark.palmer@enron.com"
    ]
  },
  "From: anne.bike@enron.com": {
    "test_samples": [
      [
        "We are working on improvements before we meet next week, so please see the sheet as it is right now.",
        "Kim: Kristen and I will be reviewing and making enhancements to this before we meet next week, but here is the sheet as it stands, now. Thanks Anne"
      ],
      [
        "We survived \"Crashing\" of the systems, that's good. Have a great evening.",
        "I guess we survived the \"Crashing\" of the systems. Excellent ! Have a good evening. Anne"
      ],
      [
        "We made great progress on the model, I will have a parallel version for Keith tomorrow afternoon.",
        "Mike and Jeff: Keith and I made some excellent progress on the model. I should have a version for Keith to parallel tomorrow afternoon. Thanks Anne"
      ]
    ],
    "val_samples": [
      [
        "You can enjoy a terrific dinner and afternoon at the Spa.",
        "Have a terrific dinner, and afternoon at the Spa."
      ],
      [
        "Anne, thanks for all of your help and advise, it was a mess, here is the scoop.",
        "Here is the scoop. What a mess. Thanks for all of your help and advise. Anne"
      ],
      [
        "You should talk to Kim about this.",
        "No ! You need to talk to Kim about this."
      ],
      [
        "I don't have to worry about that, because the Price desk may have a process that would work for us.",
        "No problem. I need to talk to Keith, but it looks like the Price desk may have a process that would work for us."
      ]
    ],
    "target": [
      "From: shanna.husser@enron.com",
      "From: scott.dieball@enron.com",
      "From: j.harris@enron.com",
      "From: darren.vanek@enron.com",
      "From: allison.navin@enron.com"
    ]
  },
  "From: archiving@enron.com": {
    "test_samples": [
      [
        "Mary Hain/HOU/ECT made a list of projects.",
        "List of projects (created by Mary Hain/HOU/ECT on 3/15/99)"
      ],
      [
        "There is a GRS ElectricGasOil Alert which was created by \"Gadsden Research Services, Inc.\"",
        "GRS ElectricGasOil Alert (5-25-99): FERC Annual Reports available (created by \"Gadsden Research Services, Inc.\" <grsinc@erols.com> on 5/25/99)"
      ],
      [
        "Mary Hain/HOU/ECT created ECT numbers for the 1997 revenue from the World Resource Tax Agency.",
        "Re: ECT NUMBERS FOR 1997 Revenues FROM WRTA (created by Mary Hain/HOU/ECT on 3/29/99)"
      ]
    ],
    "val_samples": [
      [
        "Susan J Mara/NA/ Enron created the CMUA FERCCOMMENTS that support the release of information.",
        "CMUA FERC COMMENTS SUPPORT RELEASE OF INFORMATION and WIDER PENALTY BAND WIDTH (created by Susan J Mara/NA/Enron on 11/22/2000)"
      ],
      [
        "Mary Hain/HOU/ECT created the accomplishments on 5/7/99.",
        "Accomplishments (created by Mary Hain/HOU/ECT on 5/7/99)"
      ],
      [
        "The responsibilities were created by Mary Hain/ HOU/ ECT on the 10th anniversary of 9/11.",
        "Accomplishments (created by Mary Hain/HOU/ECT on 11/19/98)"
      ],
      [
        "Mary Hain/HOU/ECT created a list of people for my evaluation.",
        "List of People for my evaluation (created by Mary Hain/HOU/ECT on 11/13/98)"
      ],
      [
        "The letter to the manager was created by \"SETTAM@bracepatt.com\".",
        "Letter to Manager requesting Facilitator (created by \"Andrea Settanni\" <SETTAM@bracepatt.com> on 4/28/99)"
      ]
    ],
    "target": [
      "From: horton@enron.com",
      "From: roger.yang@enron.com",
      "From: lara.leibman@enron.com",
      "From: craig.buehler@enron.com",
      "From: rosalee.fleming@enron.com"
    ]
  },
  "From: bill.rapp@enron.com": {
    "test_samples": [
      [
        "We're sorry it's not red-lined, but I'm not able to use that function on my computer.",
        "Attached is a revised version of our response to the CPUC. Sorry it's not red-lined. I can't get that function to work on my computer."
      ],
      [
        "Here is the address: 507086.",
        "Here it is: 507086."
      ],
      [
        "Password: houston is located on the POO# 507086.",
        "POO# 507086 Password: houston"
      ],
      [
        "The American Express commodity transaction is expected to close in the next day or two, so please call me if you have any questions or would like to discuss anything in the memo.",
        "Attached is a legal risks memo for the American Express commodity transaction, which is expected to close in the next day or two. Please call me if you have any questions or would like to discuss anything in the memo."
      ],
      [
        "Unfortunately not.",
        "No, unfortunately not."
      ]
    ],
    "val_samples": [
      [
        "The first draft of the letter was sent to the operators that have not yet executed new OBAs.",
        "Attached for your review and comments is a first draft of the letter that Kim requested to the operators that have not yet executed new OBAs."
      ],
      [
        "Attached for your review and comments is a draft of TW's response to the protest filed by the California Public Utilities Commission.",
        "Attached for your review and comments is a draft of TW's response to the protest filed by the California Public Utilities Commission of the latest negotiated rate filing."
      ],
      [
        "If this looks ok, please let me know and we will finalize it and file it today.",
        "A revised red-lined draft is attached reflecting some additional comments from Greg. If this looks ok, please let me know and we'll finalize and file it today."
      ],
      [
        "It's fine with me.",
        "That's fine with me."
      ],
      [
        "I'd appreciate it if you could call me (extension 35269).",
        "Greg, Please call me (extension 35269). Thanks."
      ]
    ],
    "target": [
      "From: l..denton@enron.com",
      "From: shanna.husser@enron.com",
      "From: sue.nord@enron.com",
      "From: exchange.administrator@enron.com",
      "From: margaret.carson@enron.com"
    ]
  },
  "From: bradley.diebner@enron.com": {
    "test_samples": [
      [
        "I will be out of the office for a day. If you have a question, call Tom Moran.",
        "I will be out of the office 12/4-12/8. If you have any urgent EOL questions, call Tom Moran 33017 Thanks, Brad"
      ],
      [
        "Can you tell me what you think of the confidentiality agreement with my credit customer?",
        "Dan, My credit customer is insisting on his confidentiality agreement for financial statements. Can you look at this and tell me what you think? Thanks, Brad"
      ]
    ],
    "val_samples": [
      [
        "The wrong product was picked and it should have been the U.S. emission and not emission auctions.",
        "The attached is another amendment. The wrong product was picked. It should have been U.S. emission and not emission auctions. Tana, I believe you have already looked at this. Thanks, Brad"
      ],
      [
        "I wish you well, bd.",
        "Regards, bd"
      ],
      [
        "Brad, they will be on today's approval list.",
        "they will be on today's approval list Thanks, Brad"
      ],
      [
        "Brad, thanks for adding her to the approval list.",
        "I have already added her to the approval list. Thanks, Brad"
      ]
    ],
    "target": [
      "From: steven.kean@enron.com",
      "From: lexi.elliott@enron.com",
      "From: brent.price@enron.com",
      "From: e.taylor@enron.com",
      "From: harry.woodson@enron.com"
    ]
  },
  "From: brandee.jackson@enron.com": {
    "test_samples": [
      [
        "Brandee Jackson is from Houston.",
        "Brandee Jackson 713-345-4013"
      ],
      [
        "Attachment followed by inline attachment.",
        "--------- Inline attachment follows ---------"
      ]
    ],
    "val_samples": [
      [
        "If you haven't filled this out, it's just a brief reminder.",
        "JUST A FRIENDLY REMINDER IF YOU HAVE NOT YET FILLED THIS OUT."
      ],
      [
        "I need to know if you are out for the months of November and December. Please reply by Monday, the 29th.",
        "Hello, Please let me know any time that you may be out of the office for the months of November and December. Please respond by Monday, the 29th. Thanks, Brandee Jackson 713-345-4013"
      ],
      [
        "All time sheets are due on Tuesday, May 1st. If you need assistance entering your time, please call Alex or Brandee.",
        "Just a reminder that all time sheets are due by 3:00 , Tuesday, May 1st. If you need assistance entering your time, please call Alex or Brandee. Thank You!"
      ]
    ],
    "target": [
      "From: mary.cook@enron.com",
      "From: rosalee.fleming@enron.com",
      "From: judy.townsend@enron.com",
      "From: steven.harris@enron.com",
      "From: archiving@enron.com"
    ]
  },
  "From: brent.price@enron.com": {
    "test_samples": [
      [
        "This is the memo that I was referring to.",
        "this is the memo I was referring to -"
      ],
      [
        "We will have time on your schedule tomorrow to discuss.",
        "As discussed, we will get time on your schedule tomorrow afternoon (Friday) to discuss."
      ]
    ],
    "val_samples": [
      [
        "I'm not sure what to make of it...",
        "fyi..."
      ],
      [
        "Please forwards this e-mail to your teams to let them know about recent organizational changes in Gas Operations.",
        "Please forward this e-mail to your teams regarding recent organizational changes within Gas Operations."
      ],
      [
        "No hotel for dinner; no shirt size; and Tenderloin for dinner; but not a hotel.",
        "Tenderloin for dinner; XL shirt size; no hotel Enron North America Corp."
      ]
    ],
    "target": [
      "From: john.valdes@enron.com",
      "From: n..gray@enron.com",
      "From: louis.dicarlo@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: john.schwartzenburg@enron.com"
    ]
  },
  "From: bryan.hull@enron.com": {
    "test_samples": [
      [
        "Here's the dirty list, please let me know who you're looking at and I can dig further, but it's a list.",
        "here's the list, dirty, but it's a list, let me know who you're looking at and i can dig further"
      ],
      [
        "Do you want to have drinks this evening?",
        "anybody up for drinks this evening?"
      ],
      [
        "Here are some things that you can check out.",
        "Check these out:"
      ],
      [
        "Why do you want to be with a girl from LSU?",
        "Then why are you dating a girl from LSU?"
      ],
      [
        "For the third time.",
        "for the third time......"
      ]
    ],
    "val_samples": [
      [
        "These may help with the work you're doing for Redmond.",
        "These may help w/the stuff you're working on for Redmond"
      ],
      [
        "You need to do more.",
        "You need more to do. Luis Mena@ENRON 12/04/2000 04:13 PM"
      ],
      [
        "I'm not able to attend a recruiting dinner.",
        "Can't, I'm going to a recruiting dinner. Enron North America Corp."
      ],
      [
        "WassupSouthPark1.exe is what it is - a game from the show South Park.",
        "- WassupSouthPark1.exe"
      ],
      [
        "Please let us know if he lost all of his stuff... http://www.algorelost.com/",
        "Please tell all he lost.... http://www.algorelost.com/"
      ]
    ],
    "target": [
      "From: exchangeinfo@nymex.com",
      "From: david.allan@enron.com",
      "From: richard.hrabal@enron.com",
      "From: margaret.carson@enron.com",
      "From: ted.evans@enron.com"
    ]
  },
  "From: c..williams@enron.com": {
    "test_samples": [
      [
        "I need to use my cell phone on Wednesday, but I'm not sure if that's a problem.",
        "I would like to take a day off this Wednesday. I will have my cell phone on (281-414-0364). Please let me know if this is a problem. Thanks."
      ],
      [
        "I may not be able to attend due to a meeting with outside counsel on the SEC investigation.",
        "Jeff, I may have to miss this due to a meeting with outside counsel on the SEC investigation."
      ],
      [
        "Jim mentions some information in his first sentence, would one of you guys be able to give him that information?",
        "Would one of you guys have the info Jim mentions in his first sentence?"
      ],
      [
        "The only version of the email I received was the one that was sent to the wrong Bob Williams, it's not serious if it went to the wrong person.",
        "Vince, I received the copy of the letter to the SEC but this is the only version of this email that I received. It is not serious if it went to the \"wrong\" Bob Williams."
      ],
      [
        "I can give you an update about where we stand with the possible filing to protect a retroactive suspension of direct access.",
        "Jim, here is a good update on where we stand with a possible filing to protect a retroactive suspension of direct access. Please call me with any questions."
      ]
    ],
    "val_samples": [
      [
        "The purpose of this document is to get management approval for a settlement along the lines indicated in the attached draft.",
        "Please see the attached draft. The purpose of this document would be to get management approval for a settlement along the lines indicated."
      ],
      [
        "I hope you continue your help, you have a lot of good ideas, and we need them all.",
        "Richard, thanks. I hope you can continue to help. You have a lot of good ideas, and we need them all."
      ],
      [
        "Cindy knows that we are aiming for 11:30, is that a convenient time for you?",
        "Cindy knows about it. We are aiming for 11:30 CST. Is that a convenient time for you?"
      ],
      [
        "A legal memo is followed by a legal memo.",
        "a legal memo follows"
      ],
      [
        "Linda and Richard, I am forwarding your email to you, so please don't hesitate to call me if you have any questions.",
        "Rita, thanks. Alas, I am not handling this any longer; Richard Sanders and Linda Guin are. Thus, I am forwarding your email to them. Linda/Richard, please feel free to call me with any questions."
      ]
    ],
    "target": [
      "From: lorna.brennan@enron.com",
      "From: e.taylor@enron.com",
      "From: dan.bump@enron.com",
      "From: bill.rapp@enron.com",
      "From: paula.rieker@enron.com"
    ]
  },
  "From: carlos.alatorre@enron.com": {
    "test_samples": [
      [
        "Mark, I am going to have a meeting with Joe King on Thursday at 10:00, I hope this is useful.",
        "Mark, I hope this is of some use, I have schedule a meeting for Thursday @10:00 to go over it with Joe King Thanks, Carlos"
      ],
      [
        "Please let me know what you think about the changes we comment on during the meeting.",
        "Please find attached a revised prod. Description with the changes we comment during the meeting. Please let me know any comments/questions. Thanks Carlos x5-8705"
      ]
    ],
    "val_samples": [
      [
        "Sara, below is a list of the exchange products that are currently active on EnronOnline, I will be in touch at 2 pm Carlos.",
        "Sara, Below you can find the FX products that are currently active on EnronOnline Thanks & see you at 2:00 pm Carlos"
      ],
      [
        "Mark, please let me know what you think of the first draft of the Amendment to the ETA for having 3rd Party Pipelines posting prices on EnronOnline, I attached it with your comments.",
        "Mark, Please find attached a first Draft of a suggested outline for the Amendment to the ETA for having 3rd Party Pipelines posting prices on EnronOnline. Please let me know your comments and how you want to proceed. Thanks Carlos"
      ],
      [
        "Please find the location.",
        "Please find atatched. Thanks"
      ]
    ],
    "target": [
      "From: bryan.hull@enron.com",
      "From: monika.causholli@enron.com",
      "From: kim.theriot@enron.com",
      "From: anne.bike@enron.com",
      "From: john.schwartzenburg@enron.com"
    ]
  },
  "From: chris.dorland@enron.com": {
    "test_samples": [
      [
        "Please contact the office of Enron Canada in the city of calgary, where I will be able to give you more information.",
        "Margaret, Please send them to the Calgary office to my attention: Enron Canada Corp. Atten: Chris Dorland 3500 Canterra Tower Calgary, AB T2P 4H2 Thank you, Chris Dorland"
      ],
      [
        "We're flying blind here because Gaskill hasn't set us up on the fundy's site.",
        "Dave can you send me your morning weather package. Gaskill hasn't set us up on the fundy's site and we are flying blind up here. Thanx Chris 403-974-6910"
      ],
      [
        "Chris Dorland, thank you for asking Brad, can you add Ricardo.Perez@enron.com to the distribution list?",
        "Brad, Can you add Ricardo.Perez@enron.com to this distribution list? Thank you, Chris Dorland"
      ],
      [
        "This just happened, Skilling resigns for personal reasons.",
        "This just in. Skilling resigns for personal reasons. More to follow..."
      ],
      [
        "Try to find a sub. Johnny is what we're talking about.",
        "Yeh! Sept.6-7 Try to find a sub. This is Johnny we're talking about."
      ]
    ],
    "val_samples": [
      [
        "You owe me $35 for flowers, that is a nice day to walk to work.",
        "You owe me $35 for flowers. Nice day to walk to work. Chris"
      ],
      [
        "There are offers.",
        "OFFERS"
      ],
      [
        "Chris, how about Thursday?",
        "How about Thursday. Chris"
      ],
      [
        "Good news from Toronto, that work is being done on the documentation.",
        "Good news from Toronto. Work on the documentation. Chris"
      ],
      [
        "I've heard that it is beautiful, how was you there?",
        "Congrats! How was Bali? I've heard it is beautiful. cd"
      ]
    ],
    "target": [
      "From: anne.bike@enron.com",
      "From: bill.rapp@enron.com",
      "From: aleck.dadson@enron.com",
      "From: kim.theriot@enron.com",
      "From: linda.noske@enron.com"
    ]
  },
  "From: christi.nicolay@enron.com": {
    "test_samples": [
      [
        "The ancillary services can be found in Schedules 1-6.",
        "Schedules 1-6 have the ancillary services."
      ],
      [
        "It's something that's interesting.",
        "FYI"
      ],
      [
        "Joe Hartsoe's summaries of the recent orders from the FERC can be found here.",
        "See Joe Hartsoe's summaries of FERC recent RTO orders."
      ],
      [
        "Is it necessary for you to see attachment?",
        "See attachment. Is that something that you need to see?"
      ],
      [
        "It's true.",
        "FYI."
      ]
    ],
    "val_samples": [
      [
        "Can you all help with the issues in California?",
        "Can you all help with the California issues?"
      ],
      [
        "This discusses Dynegy's comments on the Notice of Interim Reliability measure.",
        "This discusses Dynegy's comments on FERC's Notice of Interim Reliability measure for this summer. Enron participated through EPSA (see my separate email)"
      ],
      [
        "It came from my voice mail.",
        "Per my voice mail."
      ],
      [
        "We're sending a copy of the letter to TVA.",
        "We are sending this letter to TVA today. (Hardcopy sent to Cynthia)."
      ],
      [
        "The comments are due on the first day of the new year.",
        "Comments due 1/1/01."
      ]
    ],
    "target": [
      "From: harry.woodson@enron.com",
      "From: scott.dieball@enron.com",
      "From: tim.belden@enron.com",
      "From: archiving@enron.com",
      "From: allison.navin@enron.com"
    ]
  },
  "From: clement.abrams@enron.com": {
    "test_samples": [
      [
        "The attachment contains my comments, but there aren't many.",
        "Sara, The attachment below contains my comments. There are not many. Clement"
      ],
      [
        "If you have any questions, please contact me, Clement Russell Diamond.",
        "Attached are my comments to the the above guaranty. Call me if you have questions. Clement Russell Diamond@ECT 12/13/2000 01:51 PM"
      ],
      [
        "Here's the draft opinion, Clement, you'll find it here.",
        "Tana, Here's the draft opinion. Clement Tana Jones@ECT 10/17/2000 02:35 PM"
      ]
    ],
    "val_samples": [
      [
        "If you would like to speak to me about this matter, please feel free to call me at (713) 853-5986.",
        "Susan, As it relates to Rider A, Enron Corp. can agree to the proposed language. Please feel free to give me a call at (713) 853-5986. Regards, Clement"
      ],
      [
        "John, I agree with you more, the New York law is workable.",
        "John, I couldn't agree with you more. New York law is workable. The attached draft form looks fine. Clement John Viverito 08/24/2000 01:10 AM"
      ],
      [
        "No questions or comments, that's all.",
        "No questions or comments."
      ]
    ],
    "target": [
      "From: monika.causholli@enron.com",
      "From: ted.evans@enron.com",
      "From: dan.leff@enron.com",
      "From: david.allan@enron.com",
      "From: louis.dicarlo@enron.com"
    ]
  },
  "From: craig.buehler@enron.com": {
    "test_samples": [
      [
        "Maria moved the new provision into paragraph no. 2, the only change from the first Route was positioning.",
        "Maria moved the new provision into paragraph No. 2; other than positioning, nothing changed from the first Route..."
      ]
    ],
    "val_samples": [
      [
        "I'm working on this Mark; will get back with a confirmed number.",
        "I'm working on this Mark; will get back with a confirmed number... Craig"
      ],
      [
        "Here's the pictures.",
        "Here's the pics..."
      ],
      [
        "She thinks that they're going to re- send, because they can only have alternate's inside the path at Max Rate.",
        "Michelle just called and said it wasn't okay; they can only have alternate's inside the path at Max Rate. She thinks they're going to re-send..."
      ]
    ],
    "target": [
      "From: gramlr@pjm.com",
      "From: jeff.brown@enron.com",
      "From: ted.evans@enron.com",
      "From: gtownsend@manorisd.net",
      "From: l..denton@enron.com"
    ]
  },
  "From: dan.bump@enron.com": {
    "test_samples": [
      [
        "Dan, can you review the changes I made to Yates' Gathering Agreement due to the differences in this area and their current area?",
        "Dan Could you review a couple changes I made to Yates' Gathering Agreement (due to some operational differences of this area vs. their current area) Thanks D"
      ],
      [
        "I'm forwarding these comments to you so that we can talk about our responses at your convenience.",
        "Dan-- I'm forwarding these comments to the Mortgage Agreement from Quantum for your review. I'm not very familiar with Mortgage/credit - type issues, but let's discuss our responses at your convenience. Thx D"
      ],
      [
        "Dan, I would like to know if there are any historical pressure data that has been luckier prior to '93.",
        "Dan Thanks for the pressure info. As we discussed, any luck uncovering historical pressure data (pre-'93)? Dan"
      ]
    ],
    "val_samples": [
      [
        "It is necessary that you received this information...",
        "Just ensuring that you received this info..."
      ],
      [
        "It's a word.",
        "Word"
      ],
      [
        "An e-mail from ya'll tonite. Go boys, have a good time and don't forget to work your magic.",
        "An e-mail from ya'lls happy hour contact tonite. Go Boys!!!!! Work your respective magic (Paul = humor; G$ = silky smooth). Have a nice time tonite and for the three day weekend. D"
      ],
      [
        "Please review and discuss the highlighted issues at your own convenience.",
        "Dan'l Please review and let's discuss the highlighted issues at your convenience. Thx! Dan"
      ]
    ],
    "target": [
      "From: john.valdes@enron.com",
      "From: k..heathman@enron.com",
      "From: a..shankman@enron.com",
      "From: david.allan@enron.com",
      "From: bill.rapp@enron.com"
    ]
  },
  "From: dan.leff@enron.com": {
    "test_samples": [
      [
        "We are all on the same page when it comes to the resolution, timing, and responsibilities.",
        "Beth / Evan Making sure we are all on the same page re: the resolution, timing, responsibilities. thanks - Dan"
      ],
      [
        "Attached are a spreadsheet listings personnel by group.",
        "Attached is a spreadsheet listing personnel by group. Thanks - Dan"
      ]
    ],
    "val_samples": [
      [
        "What is our exposure to NIMO's gas in our service territory?",
        "When is this due? What is our gas exposure in NIMO's service territory? Who is on point? Thanks - Dan"
      ],
      [
        "Please let me know if you would like to continue our discussion.",
        "Greg - Clarification and follow up to our discussion. Let me know if you'd like to discuss further. Thank you - Dan"
      ],
      [
        "Thank you, Jeff Dan...",
        "yes please... Thank you Jeff Dan"
      ]
    ],
    "target": [
      "From: larry.may@enron.com",
      "From: bryan.hull@enron.com",
      "From: exchangeinfo@nymex.com",
      "From: janel.guerrero@enron.com",
      "From: john.schwartzenburg@enron.com"
    ]
  },
  "From: darren.vanek@enron.com": {
    "test_samples": [
      [
        "Can you please let this person know that the Enfolio is for them?",
        "Debra, Can you please who is requesting the Enfolio?"
      ],
      [
        "Please fax the document to m, and I will be happy to let you know that we have a nice weekend.",
        "Debra, Can you please prepare a Resale Agreement with NDR Energy Group, LLC and Michigan Consolidated Gas Company? Please send the document to m. Thank you and have a nice weekend. -Darren"
      ],
      [
        "Sara, trust Ed's opinion on this one!",
        "Sara, Itrust Ed's opinion on this one!"
      ],
      [
        "Please stop selling gas to Tiger. Sitara Deal# 1048759 originally from 9-19/2001 should no longer be extended.",
        "Tom, Please do not sell anymore gas to Tiger. Sitara Deal# 1048759 originally from 9/19/2001 should no longer be extended. Please call if you have any questions. -Darren"
      ]
    ],
    "val_samples": [
      [
        "I will complete my review and send the item to the mail first thing in the morning, but I want to make sure I know if that will be a problem.",
        "Thanks for the update, I will complete a review and send the worksheet up first thing in the morning. Please let me know if that will be a problem. -d"
      ],
      [
        "Please make sure you prepare and deliver an Isda to Patrice for more hanlding.",
        "Please prepare an ISDA and deliver to Patrice for further hanlding. -Darren"
      ],
      [
        "If you have any questions, you can call and I'll give you a Master Physical.",
        "Please prepare a Master Physical according to the terms of the worksheets. Please call if you have any questions. -Darren"
      ],
      [
        "It was a request of Gerald Nemec for a master physical to be done with Sierra Pacific Power Co.",
        "Here a workseet for a Master Physical with Sierra Pacific Power Co per request of Gerald Nemec."
      ],
      [
        "You hurt my feelings by not waiting for me to call, so give me a call when you can.",
        "You hurt my feelings b/c you didn't wait for my call. Give me a call when you can. -d"
      ]
    ],
    "target": [
      "From: lisa.connolly@enron.com",
      "From: bryan.hull@enron.com",
      "From: steven@iepa.com",
      "From: larry.may@enron.com",
      "From: janel.guerrero@enron.com"
    ]
  },
  "From: dave.scott@enron.com": {
    "test_samples": [
      [
        "I've attached the file to reflect AGL changes over the last couple of days, while I was out of the office.",
        "No intra-day changes today ... and no changes for tomorrow 9/22. I've attached the file to reflect AGL changes over the last couple of days while I was out of the office. David"
      ]
    ],
    "val_samples": [
      [
        "David is here again.",
        "Here it is again ... David"
      ],
      [
        "The comments dated 8/30/00 identify the changes and you can call me if you have questions.",
        "Hopefully this is the final version for September FOM volumes. See the comments dated 8/30/00 identifying the changes. Call me at 713-345-7692 if you have questions. David"
      ],
      [
        "On 9/19 there will be an increase in Nipsco (NGPL) by 150/d.",
        "Intra-day change on AGL (ETNG) For 9/19 ... increase Nipsco (NGPL) by 150/d David"
      ]
    ],
    "target": [
      "From: lara.leibman@enron.com",
      "From: kate.symes@enron.com",
      "From: richard.hrabal@enron.com",
      "From: john.forney@enron.com",
      "From: kim.theriot@enron.com"
    ]
  },
  "From: david.allan@enron.com": {
    "test_samples": [
      [
        "It might be worthwhile to speak with Allen andMichel to find out why sales were so strong in Europe and North America.",
        "Any clue why sales were strong in Europe and North America? It might be worthwhile to talk to Allen Whitman and Michel Valois and see if they know. Cheers, Dave"
      ],
      [
        "Dave had some good news about Enron.",
        "Some good news on Enron! Dave"
      ]
    ],
    "val_samples": [
      [
        "Thank you, Dave!",
        "good wrap! Thanks, Dave"
      ],
      [
        "The round-table and the brainstorming on how to create value for traders are related.",
        "1) Round-table on current projects 2) Brainstorming on how to create value for traders"
      ],
      [
        "Presentations by Jay on opportunities and lumber/OSB contracts; presentations by all product warriors on what they need to do to meet goals; and a discussion about what they need to do in the next six to twelve months.",
        "presentation by Jay on basis opportunities and lumber/OSB contracts; presentation by all product warriors on what their traders; 6-12-month goals are; brainstorming"
      ],
      [
        "Dave, fyi--- Monika.",
        "Monika, fyi---Dave"
      ]
    ],
    "target": [
      "From: tori.kuykendall@enron.com",
      "From: bill.rapp@enron.com",
      "From: karolyn.criado@enron.com",
      "From: sara.shackleton@enron.com",
      "From: mark.palmer@enron.com"
    ]
  },
  "From: david.parquet@enron.com": {
    "test_samples": [
      [
        "To keep you on point, why don't you give them Skilling's/Lay's name as the primary and alternate?",
        "Jeff - to keep you on point for this, why don't you send them Skilling's/Lay's name as primary and Kean as alternate."
      ],
      [
        "I wish you well in your future endeavors. I enjoyed knowing you and have learned a lot from your leadership.",
        "I want to personally express my sadness in your leaving. I have really enjoyed knowing you and have learned alot from your leadership. Best of luck to you in whatever you do. David Parquet"
      ]
    ],
    "val_samples": [
      [
        "Please review the attached asap, I have been interrupted at least 13 times trying to write it.",
        "Please review the attached ASAP. I have been interrupted at least 13 times trying to write it. Feel free to comment. I will send out to the Memo's distribution list once you guys have commented. Thanks."
      ],
      [
        "\"Look's OK to me\", Kevin called me, I filled him in on our projects.",
        "LOOKS OK TO ME. KEAN CALLED AND I FILLED HIM IN OUR PROJECTS. Jeff Dasovich@ENRON Sent by: Jeff Dasovich@ENRON 11/07/2000 02:27 PM"
      ]
    ],
    "target": [
      "From: bill.rapp@enron.com",
      "From: mary.cook@enron.com",
      "From: sylvia.hu@enron.com",
      "From: peter.keavey@enron.com",
      "From: michael.brown@enron.com"
    ]
  },
  "From: djenergy@dowjones.com": {
    "test_samples": [
      [
        "The Electricity Price Indexes.doc is a document that tracks electricity prices.",
        "- ELECTRICITY PRICE INDEXES.doc"
      ],
      [
        "Last night, we had some problems with sytems.",
        "<<MidC.xls>> Resending to sytems problems last night. - MidC.xls"
      ],
      [
        "Resending due to systems problems last night.",
        "<<MeadMktplace.xls>> Resending due to systems problems last night. - MeadMktplace.xls"
      ],
      [
        "The midc.xl's is an abbreviation for MidC.",
        "- MidC.xls"
      ]
    ],
    "val_samples": [
      [
        "There is a small dog named Cob.xls.",
        "- Cob.xls"
      ],
      [
        "Resending due to problems last night.",
        "<<Palo.xls>> Resending due to sytems problems last night. - Palo.xls"
      ],
      [
        "Kate, your phone number is on the fax sheet, but it's not yours. I have the same phone number, 609-520-4683.",
        "Hello Kate, FYI, the phone number that you have on the fax sheet (609-520-4452) is Jennifer's phone number. My phone number is 609-520-4683 Have a good weekend. Eric"
      ],
      [
        "The PJM.xls is an acronym for PJM.",
        "- PJM.xls"
      ],
      [
        "The pages are in the form of a 15 page document.",
        "- SP 15 pages.xls"
      ]
    ],
    "target": [
      "From: robert.hayes@enron.com",
      "From: n..gray@enron.com",
      "From: rhonda.denton@enron.com",
      "From: mark.palmer@enron.com",
      "From: linda.noske@enron.com"
    ]
  },
  "From: donna.teal@enron.com": {
    "test_samples": [
      [
        "If you'd like to attend the May 2002 China trip, please contact the person who created the attached information.",
        "Attached is the information on the May 2002 China trip. If interested please contact Georgi Landau at ext. 54435."
      ]
    ],
    "val_samples": [
      [
        "I'd like to know if anyone wants to sell their Cirque du Soleil tickets or if you're interested in doing so.",
        "Please contact Iris Waser at x36059 if you or someone you know want to sell their Cirque du Soleil tickets? Iris has received several inquiries for tickets. Thanks, Donna"
      ],
      [
        "Donna, you can see the email below.",
        "Please see email below. Thanks, Donna"
      ],
      [
        "Please RSVP to Margaret Doucette asap if you want to attend the December Travel Club meeting.",
        "The December Travel Club meeting is scheduled for tomorrow, 12/12 from 12:00 - 1:00 in EB5C2. Please RSVP to Margaret Doucette ext. 67708 ASAP. Thanks, Donna"
      ]
    ],
    "target": [
      "From: mary.cook@enron.com",
      "From: mike.smith@enron.com",
      "From: gtownsend@manorisd.net",
      "From: j.harris@enron.com",
      "From: kathleen.carnahan@enron.com"
    ]
  },
  "From: e..dickson@enron.com": {
    "test_samples": [
      [
        "The spot GTC's will be sent soon, please call me with any questions, I have also attached a redlined version.",
        "Kevin, Here are the Firm GTC's with and without collateral and with and without signature lines. I have also attached a redlined version. I will send the spot GTC's shortly. Please call me with any questions. Stacy"
      ],
      [
        "I'll prepare this for you.",
        "I will prepare this. Stacy"
      ],
      [
        "Mark, Janet is on vacation, she hasn't seen the amendment.",
        "Mark, Attached is the EOL amendment for Dynegy. Janet is on vacation until next week. She has not seen this amendment. Stacy"
      ],
      [
        "Mark, Janet does not need to see the amendment because of the lack of trade power between the two entities.",
        "Mark, Attached is an EOL Amendment for the Texaco entities. EPMI does not trade power with Texaco so Janet does not need to see this amendment. Stacy"
      ]
    ],
    "val_samples": [
      [
        "Kim, if you need anything else, please let me know.",
        "Kim, Attached are the Frito-Lay Special Provisions that include Jay's comments and my comments. Please let me know if you need anything else. Stacy"
      ],
      [
        "Thank you for your kind words.",
        "Thank you."
      ],
      [
        "I am fine with the new type of product. I am still looking into the CIG product.",
        "Chris, Thank you for checking on that. I am fine with the new product type. I am still looking into the CIG product. Stacy"
      ],
      [
        "I'd be glad to help you with your work on ENA Upstream.",
        "I would be glad to do whatever I can to facilitate YOUR working on ENA Upstream."
      ],
      [
        "Mark, Bridgeline doesn't trade power.",
        "Mark, Here is Bridgeline. They do not trade power. Stacy"
      ]
    ],
    "target": [
      "From: bradley.diebner@enron.com",
      "From: jeff.brown@enron.com",
      "From: amy.fitzpatrick@enron.com",
      "From: lillian.villarreal@enron.com",
      "From: exchangeinfo@nymex.com"
    ]
  },
  "From: e.taylor@enron.com": {
    "test_samples": [
      [
        "I am trying to purchase a ticket but I don't know how much it is going to cost.",
        "How much are the tickets going on your site? I am trying to buy one."
      ],
      [
        "Texas 5, California 1, LA Tech 1, and a state in Washington.",
        "Texas 5 WA Stanford LA TECH Fresno state 1"
      ],
      [
        "How far away from Houston is it?",
        "how far from Houston?"
      ],
      [
        "LA Tech was followed by Maryland, Hawaii, and Eastern Michigan.",
        "LA TECH #4 Maryland #3 Hawaii #2 Eastern Michigan #1"
      ],
      [
        "jessbishop@yahoo.com",
        "jess_bishop@yahoo.com"
      ]
    ],
    "val_samples": [
      [
        "I printed out the two documents for him to read. John doesn't like to be told what to do.",
        "I understand. I am not the one holding you up. I printed out both documents for him to read. John doesn't take commands from me. I will make any revisions he has made on his printed copies tomorrow."
      ],
      [
        "He wanted a HGA NOx presentation.",
        "he asked for HGA NOx presentation."
      ],
      [
        "I don't know why someone would think JohnMassey is not a nice guy.",
        "Who says that John Massey is not a nice guy?"
      ],
      [
        "I'm in!",
        "I am in!"
      ],
      [
        "It is possible that we might win then.",
        "Maybe we might win then."
      ]
    ],
    "target": [
      "From: david.allan@enron.com",
      "From: e..dickson@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: rosalee.fleming@enron.com",
      "From: john.schwartzenburg@enron.com"
    ]
  },
  "From: exchange.administrator@enron.com": {
    "test_samples": [
      [
        "The line attachment follows.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The line attachment follows the one before it.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "In line attachment is followed.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The inline attachment will be followed by a second one.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The line attachment follows.",
        "--------- Inline attachment follows ---------"
      ]
    ],
    "val_samples": [
      [
        "The line attachment is followed by a second one.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The Inline attachment is followed by the line attachment.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The attachment is followed by an Inline attachment.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The line attachment follows the one before it.",
        "--------- Inline attachment follows ---------"
      ],
      [
        "The inline attachment followed by the line attachment is referred to as an inline attachment followed by the line attachment.",
        "--------- Inline attachment follows ---------"
      ]
    ],
    "target": [
      "From: n..gray@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: k..heathman@enron.com",
      "From: lisa.yoho@enron.com",
      "From: wanda.curry@enron.com"
    ]
  },
  "From: exchangeinfo@nymex.com": {
    "test_samples": [
      [
        "There is a notice with the following words: Notice No:00-352.",
        "Notice No: 00-352"
      ],
      [
        "The notice was issued on April 24, 2001.",
        "April 24, 2001 Notice No.: 01-140"
      ],
      [
        "There is a notice that was published on April 5, 2001.",
        "Notice No. 01-124 April 5, 2001"
      ],
      [
        "The notice was sent to the members on May 16, 2001.",
        "Notice to Members No. 01-167 May 16, 2001"
      ],
      [
        "April 5, 2001 is the date of the notice.",
        "Notice No: 01-123 April 5, 2001"
      ]
    ],
    "val_samples": [
      [
        "September 29, 2000 is the date of this notice.",
        "Notice No. 00-337 September 29, 2000"
      ],
      [
        "There is a notice that says \"00-352.\"",
        "Notice No: 00-352"
      ],
      [
        "There was a notice to members on October 27, 2000.",
        "October 27, 2000 Notice To Members #00-364"
      ],
      [
        "May 4, 2001 is the date of the notice.",
        "Notice No.: 01-153 May 4, 2001"
      ],
      [
        "There was a notice on June 7, 2001.",
        "Notice No: 01-193 June 7, 2001"
      ]
    ],
    "target": [
      "From: gtownsend@manorisd.net",
      "From: k..heathman@enron.com",
      "From: n..gray@enron.com",
      "From: jordan.mintz@enron.com",
      "From: craig.buehler@enron.com"
    ]
  },
  "From: f..calger@enron.com": {
    "test_samples": [
      [
        "Chris Calger was done.",
        "done Chris Calger 503-464-3735"
      ],
      [
        "He can't be a part of my team even if you change his mind.",
        "no - he cant be on my team even if you changed his mind Chris Calger 503-464-3735"
      ],
      [
        "Chris Calger is from the area.",
        "Chris Calger 503-464-3735"
      ],
      [
        "Chris Calger sounds good.",
        "sounds good Chris Calger 503-464-3735"
      ],
      [
        "There's another file for the 1:00PM meeting, this one by Chris Calger.",
        "Here's another file for the 1:00PM meeting Chris Calger 503-464-3735"
      ]
    ],
    "val_samples": [
      [
        "If you have not been granted access, please let me know.",
        "The lists have been moved to o/common/pwrmarketing so they are accessible for people in both Houston and Portland. Please let me know if you have not been granted access."
      ],
      [
        "Chris Calger is from the area.",
        "Chris Calger 503-464-3735 FYI"
      ],
      [
        "Chris Calger said that the machines may have been a part of a MHI bid.",
        "Calpine just bought 27 Siemens machines - they may be a MHI bid. Chris Calger 503-464-3735"
      ],
      [
        "I haven't heard from faith or seen any numbers.",
        "I have not seen any numbers nor have I heard from faith. -------------------------- Sent from my BlackBerry Wireless Handheld (www.BlackBerry.net)"
      ],
      [
        "Chris Calger hates to bug you, but the deal is probably more difficult to close when Wolfe walks.",
        "Hate to bug you again on this, but the deal probably gets tougher to close when Wolfe walks. Chris Calger 503-464-3735"
      ]
    ],
    "target": [
      "From: wanda.curry@enron.com",
      "From: lisa.yoho@enron.com",
      "From: amy.copeland@enron.com",
      "From: gramlr@pjm.com",
      "From: sara.shackleton@enron.com"
    ]
  },
  "From: george.mcclellan@enron.com": {
    "test_samples": [
      [
        "We don't kill any stinkin' cows, it's a great day. TVA here we come.",
        "It's a great day when we don't kill no stinkin' cows. Nice work - TVA here we come. George"
      ],
      [
        "Guys, can we discuss this at our lunch meeting today?",
        "Guys - we need to address this - can we discuss during our lunch meeting today."
      ]
    ],
    "val_samples": [
      [
        "It was as info.",
        "As info."
      ],
      [
        "We are seeing a lot of negative comments on our credit in the market, what can we tell our counterparties that will calm the waters?",
        "We are seeing negative comments in the market on our credit - what information can we provide our to our counterparties that will calm the waters? George"
      ],
      [
        "Thank you Vince, it was great to hear of your promotion.",
        "Thanks Vince. It was good to learn of your promotion as well. Cheers."
      ],
      [
        "I told Joe that he could call me if he wanted to learn more about buying assets from EGM.",
        "Joe McAlister of Mirant called last week to advise their interest in buying assets from EGM ( weather, coal , other?). I told him I would advise you of the call. George"
      ]
    ],
    "target": [
      "From: dave.scott@enron.com",
      "From: e.taylor@enron.com",
      "From: steven.harris@enron.com",
      "From: shanna.funkhouser@enron.com",
      "From: robert.hayes@enron.com"
    ]
  },
  "From: gramlr@pjm.com": {
    "test_samples": [
      [
        "This didn't work out earlier, so I'm trying again.",
        "Jeff, this didn't go through earlier so I'm trying again. >"
      ],
      [
        "I did not receive the message until this morning because our e-mail was down.",
        "I got the message but not til today because our e-mail was down. It was good to talk to you last night. >"
      ]
    ],
    "val_samples": [
      [
        "The option is mentioned today by Rob Rob Gramlich of the PJM Market Monitoring Unit.",
        "I'd like to at least mention the option today. Rob Rob Gramlich PJM Market Monitoring Unit (610) 666-4291 gramlr@pjm.com"
      ],
      [
        "Will do, I drew a lot of inspiration from your proposal.",
        "Will do. I drew heavily on your proposal for the agenda I sent around. Rob >"
      ]
    ],
    "target": [
      "From: lexi.elliott@enron.com",
      "From: horton@enron.com",
      "From: louis.dicarlo@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: rhonda.denton@enron.com"
    ]
  },
  "From: gtownsend@manorisd.net": {
    "test_samples": [
      [
        "Hey, do you know what I can do to get in touch with him? Let me know.",
        "G, How's it going? The horns had a decent season I guess. Hey, do you know how I can get a hold of Ernie? Let me know. GT"
      ]
    ],
    "val_samples": [
      [
        "The weekend looks good. I'm ready to go, but I have to do a little homework. Houston may kick our ass.",
        "G. The weekend looks good. I have to do a little homework. Other than that I am ready to go. Houston just may kick our ass. Your room is available either night. GT >"
      ],
      [
        "I am coming to Houston this weekend.",
        "G, Are you in Houston this weekend? I am coming into town. GT"
      ],
      [
        "There is a boat dock next to Carlos y Charlies.",
        "That's the boat dock next to Carlos y Charlies."
      ]
    ],
    "target": [
      "From: judy.townsend@enron.com",
      "From: john.forney@enron.com",
      "From: kathleen.carnahan@enron.com",
      "From: paula.rieker@enron.com",
      "From: brent.price@enron.com"
    ]
  },
  "From: harry.woodson@enron.com": {
    "test_samples": [
      [
        "If you have any questions, please give me a call.",
        "Attached is the Bushton Balance through November 22, 2001. If there are any questions, please call me at (713) 853 -6600. Thanks, Harry Woodson"
      ],
      [
        "The cumulative balance was 37,259 for the first seven days of February 2002, and Jerry, please confirm and communicate any differences you have.",
        "Jerry, the PVR is long for the first seven days of February 2002, reflecting a cumulative balance of 37,259. Please verify and communicate any differences you have. Thanks, Harry Woodson (713) 853-6600"
      ]
    ],
    "val_samples": [
      [
        "Please call if you have any questions, I'm Harry Woodson.",
        "Attached is the Bushton Balance through November 24, 2001. If there are any questions, please call me at (713) 853 -6600. Thanks, Harry Woodson"
      ],
      [
        "If you have any questions, please contact the South-Central Team.",
        "The Final 8:00 a.m. process for gas day October 18, 2001 is complete. Final scheduled quantities are now available, if you have any questions, please contact the South-Central Team. Thanks, Harry Woodson"
      ]
    ],
    "target": [
      "From: dan.bump@enron.com",
      "From: donna.teal@enron.com",
      "From: mary.cook@enron.com",
      "From: amy.fitzpatrick@enron.com",
      "From: tim.belden@enron.com"
    ]
  },
  "From: horton@enron.com": {
    "test_samples": [
      [
        "I don't know what this project is, so please let me know by setting up a meeting with my assistant Cindy Stark.",
        "I have no idea what this project is so an update would be appreciated. Please set something up with my assistant Cindy Stark. Thanks."
      ],
      [
        "Alright with me.",
        "Ok with me."
      ]
    ],
    "val_samples": [
      [
        "Call my assistant, Cindy Stark, and make an appointment.",
        "Call my assistant, Cindy Stark and set up an appointment."
      ],
      [
        "Please send the documents to David.",
        "Yes, please go ahead and send the documents to David."
      ],
      [
        "Dana was the winner.",
        "Dana wins."
      ]
    ],
    "target": [
      "From: l..denton@enron.com",
      "From: scott.dieball@enron.com",
      "From: amy.fitzpatrick@enron.com",
      "From: david.parquet@enron.com",
      "From: rosalee.fleming@enron.com"
    ]
  },
  "From: houston": {
    "test_samples": [
      [
        "The delivery point is the Pg&E City Gate.",
        "PG&E City Gate is the delivery point and lets start out with $.05."
      ],
      [
        "I might show up, but it will be less crowded there.",
        "I think I might show up - was going to work out here but it will be less crowded there. See you there"
      ],
      [
        "Steve is sending his stuff right now.",
        "Steve Endo is sending his stuff right now."
      ],
      [
        "Lynn, I'd like to know if you have any questions, or if you have any problems.",
        "Lynn, Attached is the confirm for November. Let me know if you have any questions or problems. Thanks, Kim"
      ],
      [
        "Kim is ok, it's not a problem.",
        "ok - not a problem. Kim"
      ]
    ],
    "val_samples": [
      [
        "I meant it when I said the one related to the Griffith deal.",
        "Thanks, but I meant the one related to the Griffith deal. Do you have one?"
      ],
      [
        "I will look into it today.",
        "no. I will try to investigate today."
      ],
      [
        "I would like to know if this is okay and if you need anything else.",
        "Let me know if this is OK and if you need anything else. Thanks, Kim"
      ],
      [
        "Call me to find out if you're there.",
        "are you there? Call me - 713-853-0685"
      ],
      [
        "Quite commendable, that's what I have to say.",
        "Quite commendable, I have to say."
      ]
    ],
    "target": [
      "From: bradley.diebner@enron.com",
      "From: wanda.curry@enron.com",
      "From: steven.harris@enron.com",
      "From: amanda.rybarski@enron.com",
      "From: jordan.mintz@enron.com"
    ]
  },
  "From: j.harris@enron.com": {
    "test_samples": [
      [
        "I received a call from Paula Rieker's secretary who wanted to know if I knew of a conference call this morning.",
        "I just this minute got a call from Paula Rieker's secretary wanting to know if you were aware of a conference call this morning. I had no clue. 1-888-273-9885 - ID-614505."
      ],
      [
        "MaryAnn was asst.",
        "Asst: MaryAnn"
      ],
      [
        "If you want to call, you should call 713-853-6773.",
        "Wants you to call. 713-853-6773. S"
      ],
      [
        "There will be a Special Board Meeting at Noon today, confirmed by Kelly Johnson.",
        "Kelly Johnson just called and confirmed there will be a Special Board Meeting at Noon in EB-5001 today."
      ]
    ],
    "val_samples": [
      [
        "Whalley came by and said that he needs to speak to you right away.",
        "Whalley just came by and said he needs to talk to you ASAP. His no. is 713-853-5220. S"
      ],
      [
        "Jim will be away on Friday, October 19, 2001 so he won't be able to sign the documents.",
        "Jim Derrick will not be in the office Friday, October 19, 2001. This means he will not be able to sign documents. THX, S"
      ],
      [
        "You need to be in his office as soon as possible.",
        "Needs you ASAP in his office."
      ],
      [
        "Please let me know the time and place of the dinner so I can make reservations.",
        "JVD, Immergut's secretary wants to know the time and place for dinner Thursday night. Please let me know so I can answer her query and make reservations.. S"
      ],
      [
        "I sent a notice to everyone saying that we weren't having the call, and this is yet another example of people not paying attention.",
        "JVD, I had sent notice to everyone including Tracy and Mark Evans that we were not having the call. This is another fine example of people not paying attention. Frustrating."
      ]
    ],
    "target": [
      "From: kay.mann@enron.com",
      "From: k..heathman@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: rhonda.denton@enron.com",
      "From: mark.palmer@enron.com"
    ]
  },
  "From: janel.guerrero@enron.com": {
    "test_samples": [
      [
        "Rick told me you were pregnant, and that I hope Marianna feels better soon.",
        "Rick told me you were pregnant (you look great by the way). Congratulations, and tell Marianna I hope she feels better soon."
      ],
      [
        "Jim, I'm in NYC and need to give the andersen report to dasovich.",
        "Jim....give the andersen report to dasovich. i'm in nyc. thanks."
      ],
      [
        "Please contact the person you want to communicate with on any meetings that are scheduled so she can manage Steve's calendar since Steve will accompany Ken on his meetings next week in CA.",
        "Since Steve Kean is planning to accompany Ken on his meetings next week in CA, please be sure to cc Maureen McVicker on all meetings that are scheduled so she can manage Steve's calendar. Thanks."
      ],
      [
        "Rick would like you to attend both the 8:00 am and 10:00 am portions of the May 4th meeting.",
        "Rick would like you to attend the 8:00 am and 10:00 am portions of the May 4th meeting. Sorry to have left you out. Janel Guerrero 04/27/2001 06:01 PM"
      ],
      [
        "I apologize that I didn't include you in the email yesterday.",
        "I apologize for not including you in this email yesterday."
      ]
    ],
    "val_samples": [
      [
        "It should be quite a largesse for you to join us for a drink.",
        "Yes. Are you coming to drink with us? It should be quite the blowout give= n the circumstances."
      ],
      [
        "It would be great if Dasovich received a copy of Ken's talking points.",
        "Plz give Dasovich a copy of the talking points for Ken's bb. thanks"
      ],
      [
        "The Memorandum of Understanding can be found at www.edisoninvestor.com/exc/SCE_financial.",
        "http://www.edisoninvestor.com/financialexc/SCE_MOU.pdf"
      ],
      [
        "We're talking and planning next week.",
        "Okay, we're talking/planning next week. Gerald Nemec@ECT 02/27/2001 02:44 PM"
      ],
      [
        "The EnergyDay.doc is related to this.",
        ". - EnergyDAY.doc"
      ]
    ],
    "target": [
      "From: amy.fitzpatrick@enron.com",
      "From: louis.dicarlo@enron.com",
      "From: t..hodge@enron.com",
      "From: paul.cherry@enron.com",
      "From: george.mcclellan@enron.com"
    ]
  },
  "From: jeff.brown@enron.com": {
    "test_samples": [
      [
        "Let me know if there is anything you want me to know about the assignment.",
        "Please notice the individual assignments. Let me know if you have any questions or concerns. Thanks - Jeff"
      ],
      [
        "To clarify the document, I added a couple of sub-headings.",
        "Steve, I added a couple of sub-headings to help clarify the document. Jeff"
      ]
    ],
    "val_samples": [
      [
        "Please call me by 7 am tomorrow, I will be in by that time.",
        "Becky - I will read tonight, please call me tomorrow morning to dsicuss. I will be in by 7 am (853-4350). Thanks - Jeff Becky L Merola 08/24/2000 10:07 AM"
      ],
      [
        "Here's the latest message points from EEI.",
        "Stan, Here's the latest message points from EEI regarding retail standards. Jeff"
      ],
      [
        "The attached document has Jeff's name on it.",
        "Please see the attached document. Jeff"
      ],
      [
        "Here is the top 10 for my group.",
        "Here's the top 10 for my group. Thanks - Jeff"
      ]
    ],
    "target": [
      "From: legalonline-compliance@enron.com",
      "From: peter.keavey@enron.com",
      "From: harry.woodson@enron.com",
      "From: kay.chapman@enron.com",
      "From: lisa.gang@enron.com"
    ]
  },
  "From: jeff.duff@enron.com": {
    "test_samples": [
      [
        "Total Down Time is the sum of the total possible survey time and Total Down Time is a verification of understanding.",
        "As a verification of understanding; Total Down Time = TO - (DT + RT +LOT + MT + EST + WOT) Where TO = Total possible survey time. Thanks, Jeff"
      ],
      [
        "Mark, I think that the CA has a lot in the numerator and denominator, which is why I am coding it in the Crystal Reprots application.",
        "Mark, I thought the CA included an LOT term in both the numerator and denominator, which is how I am coding it in the Crystal Reprots application. JD Mark Fisher 05/29/2002 08:30 AM"
      ],
      [
        "The data you requested is here.",
        "Dave, Here is the data you requested. JD dfmatson@attbi.com on 06/27/2002 04:52:33 PM"
      ],
      [
        "I have put together a copy of the spec doc that should give you an idea of the capabilities but isn't as comprehensive as I'd like.",
        "Here is a copy of the spec doc I've put together. It is not as comprehensive as I'd like, but should give you an idea of the capabilities. Any input would be great. JD"
      ]
    ],
    "val_samples": [
      [
        "We should discuss how we would implement this process so I can be prepared to brief Jeff M.",
        "Of course, my only involvement with this was eve's dropping. We should discuss how we would implement this process so I can be prepared to brief Jeff M. JD"
      ],
      [
        "The instructions on how to copy the draft into another document were written in the document that I used for the DRAFT watermark.",
        "Here is the DRAFT watermark I've used. I put instructions in the document on how to copy the draft into another document. -JD"
      ],
      [
        "I think that's true.",
        "FYI"
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "I will provide the spec. to create a table for this data to be stored in.",
        "I am reviewing this document and will provide Patricia with a spec. to create an Oracle table to store this data in. -JD"
      ]
    ],
    "target": [
      "From: paul.cherry@enron.com",
      "From: jennifer.thome@enron.com",
      "From: amy.copeland@enron.com",
      "From: larry.may@enron.com",
      "From: lisa.yoho@enron.com"
    ]
  },
  "From: jeffery.fawcett@enron.com": {
    "test_samples": [
      [
        "The gravy train is not all bad.",
        "On second thought, the gravy train ain't all bad."
      ],
      [
        "I don't know what's going on.",
        "fyi"
      ],
      [
        "Have a wonderful holiday, thank you, dude.",
        "Thanks, dude. Have a great holiday!"
      ],
      [
        "Rule 51 form is attached.",
        "Attached is the executed Rule 51 form."
      ],
      [
        "Is it going to be you?",
        "Are you going?"
      ]
    ],
    "val_samples": [
      [
        "This guy didn't try to get one of these machines allowed in California.",
        "Yeah, well, this dude obviously never tried to get one of these machines permitted in California."
      ],
      [
        "Here's the website, http://www.hemmings.com.",
        "Here's the site... http://www.hemmings.com"
      ],
      [
        "I wanted to hear it straight from the expert, but that's consistent with my thinking.",
        "Thanks, Drew. That's consistent with my thinking, but I wanted to hear it straight from the expert."
      ],
      [
        "Thanks a lot, dude.",
        "Thanks, dude."
      ],
      [
        "I think that it's a thinly veiled attempt by the company to take advantage of a crisis situation, by offering power to the state by contracting only with utilities.",
        "Edison's willingness to offer power to the \"state\" by contracting only with utilities is, in my view, just a[nother] thinly veiled attempt by Edison to take advantage of a crisis situation."
      ]
    ],
    "target": [
      "From: scott_gardner@pgn.com",
      "From: clement.abrams@enron.com",
      "From: larry.may@enron.com",
      "From: houston",
      "From: margaret.carson@enron.com"
    ]
  },
  "From: jennifer.thome@enron.com": {
    "test_samples": [
      [
        "I will be out of the office on Thursday and Friday, but I can be reached on my cell phone.",
        "Murray: I will be out of the office this Thursday and Friday, June 6-7. During that time, I can be reached on my cell phone at (503) 869-5504. Thank you, Jenny"
      ],
      [
        "Jim just mentioned in the call that he was going to make a presentation on gas in CA.",
        "Attached is the part of the CERA presentation Jim just mentioned in the call (re: gas in CA). Jennifer"
      ],
      [
        "I'm attached for the menu, please let me know if you want me to bring you back.",
        "Lisa: see the attached for the menu. let me know what you want me to bring you back. Jenny http://typhoonnw.citysearch.com/1.html"
      ],
      [
        "If you haven't yet heard from Ron, I am attaching the files that I think he discussed on the call from the FERC's web site.",
        "Sue: In case you have not yet heard from Ron Carroll, I am attaching what I think are the filings discussed during this morning's call (from FERC's web site). Jennifer"
      ],
      [
        "I am hoping this is what you need.",
        "I hope this is what you needed. Jennifer"
      ]
    ],
    "val_samples": [
      [
        "I am sending a corrected version of the document after Nancy and Joe pointed out the mistake.",
        "Thank you to Nancy and Joe for pointing out a typo in the document I just sent. With a very red face (!), I am sending the corrected version. My apologies for the confusion. Jennifer"
      ],
      [
        "There have been several additional deals recently announced, note that Michael attached the last strandy costs analysis I have from Alan Comnes.",
        "Michael: Attached is the final stranded costs analysis I have from Alan Comnes. Note that there have been several additional deals recently announced. Jennifer 5-3550"
      ],
      [
        "My schedule is open the rest of the day and I would like to try to change our weekly call to 3pm tomorrow due to the all employees meeting tomorrow at 10am Central.",
        "Due to the all employees meeting tomorrow at 10am Central, I would like to try to reschedule our weekly call. My schedule is open the rest of the day. How about 3pm tomorrow?"
      ],
      [
        "We should ask MRW to do an updated analysis so we can get the QF numbers.",
        "Let's discuss how to proceed. Should we ask MRW to do an updated analysis to get QF numbers? Jennifer"
      ],
      [
        "No problem, I can only imagine the process! I have been monitoring DWR contracts and keeping an eye on what's going on.",
        "No problem - I can only imagine the process! I have been up to my ears in DWR contracts anyways."
      ]
    ],
    "target": [
      "From: harry.woodson@enron.com",
      "From: zakiyyah.mcclure@enron.com",
      "From: ted.evans@enron.com",
      "From: richard.hrabal@enron.com",
      "From: michelle.cash@enron.com"
    ]
  },
  "From: john.allario@enron.com": {
    "test_samples": [
      [
        "I would like to thank you very much, Ms. Jones.",
        "Thank you very much Ms. Jones. -JA"
      ],
      [
        "Let me know if you'd like Section 5 taken out.",
        "Hi Mark & Tana Below is Dow's message and red-lined NDA. They want Section 5 (no employee solicitation) taken out. Let me know. -JA"
      ],
      [
        "Thanks a lot.",
        "thanks"
      ]
    ],
    "val_samples": [
      [
        "Here's the email.",
        "Here's that email. -JA"
      ],
      [
        "Kim, you should see the EGM announcement under the heading global risk markets.",
        "Kim Please see EGM Announcement below under the Heading Global Risk Markets. It is here they speak of Contingent Power Price Call Options being done by David Hoog (new Guy it seems). Talk to you soon John"
      ],
      [
        "Mark Caminus asked if he was too broad in his reference to EOL.",
        "Mark Caminus took out reference to EOL. Would this be too broad? How can we accommodate their wishes below? -john"
      ],
      [
        "The legal name of the company is needed for this document.",
        "Ken What is Ajilon's full legal name? For instance, Ajilon Technoloigies Company or Ajilon Corporation, etc. The legal name is necessary for this document. - Thanks"
      ]
    ],
    "target": [
      "From: carlos.alatorre@enron.com",
      "From: amanda.rybarski@enron.com",
      "From: dan.bump@enron.com",
      "From: rhonda.denton@enron.com",
      "From: lisa.gang@enron.com"
    ]
  },
  "From: john.forney@enron.com": {
    "test_samples": [
      [
        "I am very unhappy with the situation here, and I want to leave if there is something that opens up in the company.",
        "Thanks for checking - very unhappy with the situation here. Very unprofessional and juvenile atmosphere. Looking to leave the company if something doesnt open up internally. JMF"
      ],
      [
        "JMF is a power thang.",
        "it's a power thang..... JMF"
      ],
      [
        "John Forney Director, East Power Trading, please let me know if I can get parking in the new Enron parking garage.",
        "I am interested in obtaining parking in the new Enron parking garage. I am currently in the Kellogg building. Thanks, John Forney Director, East Power Trading 3-7160"
      ],
      [
        "The issue was resolved, we did not call dispatch to let them know that we received a call from PNM to increase their contingent to 50.",
        "This issue was resolved. Enron did receive a call from PNM to increase their contingent to 50, however, we did not call dispatch at EPE to inform them. JMF"
      ]
    ],
    "val_samples": [
      [
        "JMF.",
        "JMF"
      ],
      [
        "Is that true?",
        "FYI,"
      ],
      [
        "Bryan, please give me a call so I can get in touch with you.",
        "Bryan, please give me a call at 3-7160 to arrange meeting."
      ],
      [
        "Thanks for taking care of this!",
        "Thanks for handling this! JMF"
      ],
      [
        "I am able to meet you on Tuesday, even though I will be attending a funeral tomorrow.",
        "I will be attending a funeral tomorrow, but I am available to meet on Tuesday. Thank you for checking back with me. JMF"
      ]
    ],
    "target": [
      "From: kate.symes@enron.com",
      "From: exchangeinfo@nymex.com",
      "From: kim.theriot@enron.com",
      "From: roger.yang@enron.com",
      "From: gtownsend@manorisd.net"
    ]
  },
  "From: john.schwartzenburg@enron.com": {
    "test_samples": [
      [
        "The final versions of Alstom MOU and CSA were described for you in the voice mail.",
        "Mark, here's the final versions of the Alstom MOU and CSA I described for you in the voice mail."
      ],
      [
        "Please let me know if I have a copy of the contract as well.",
        "Thnaks for the schedule. May I have a copy of the contract as well? Thanks. JWVS Susan Bailey@ECT 03/02/2001 10:16 AM"
      ]
    ],
    "val_samples": [
      [
        "Thanks Karen E Jones, okay fine, and let me know if you have any questions.",
        "OK fine, and thanks Karen E Jones@ECT 11/01/2000 11:55 AM"
      ],
      [
        "This is a Houston matter and if you don't want it, you won't get it.",
        "This one is re OEC, a Houston matter. Whic one of you want it?"
      ],
      [
        "I did not think that the Gas Supply Agreement was assigned to OEV.",
        "We are concerned re the Gas Supply Agreement - I did not think we assigned the Gas Supply Agreement to OEV."
      ]
    ],
    "target": [
      "From: steven.harris@enron.com",
      "From: archiving@enron.com",
      "From: scott_gardner@pgn.com",
      "From: sue.nord@enron.com",
      "From: judy.townsend@enron.com"
    ]
  },
  "From: john.valdes@enron.com": {
    "test_samples": [
      [
        "One book has been revised.",
        "Revised one book."
      ],
      [
        "John has received requests for RiskTrac.",
        "Requests for RiskTrac have been sent. John"
      ],
      [
        "Kam pointed out that we need to make sure that the set-up users have access to the web page as well.",
        "Andrew, I forgot a name. Also, as Kam pointed out below, can we make sure that the set-up users have access to the web page as well. Errol McLaughlin (emclaug) John"
      ],
      [
        "You will find the revised region code in the attached books.",
        "Attached you will find the books with a revised region code as requested. Thanks. John"
      ],
      [
        "Please let me know what we need to do for the group because I was out on Friday as well.",
        "I was out on Friday as well. Please let me know what we need to do for the group. John"
      ]
    ],
    "val_samples": [
      [
        "This may be able to help.",
        "This may help."
      ],
      [
        "I have East 1, 3 and 5 without a trader. Does this match my data?",
        "Kam, I have East 1 and 3 without a trader. Also, Texas 2 and 5. Does this match your data? John"
      ],
      [
        "The Canadian Gas books were received from a man named Brian Gillis in Canada.",
        "Attached are the GCP id's set up for the Canadian Gas Books. These books were received from Brian Gillis in Canada. John"
      ],
      [
        "I don't think we have accomplished anything yet, and I expect more to be done by the end of the day.",
        "We ain't done yet. I expect more shit completed by the end of the day. The ball is in my court now. JV"
      ],
      [
        "Tracy, as requested, I have attached an updated listing of the books set up for NETCO as well as the region codes for CENT.",
        "Tracy, As requested, attached is an updated listing of all the books set up for NETCO. The GCP id's have been updated as well as the region codes for CENT. Let me know if you have any questions. John"
      ]
    ],
    "target": [
      "From: sylvia.hu@enron.com",
      "From: michael.brown@enron.com",
      "From: amanda.rybarski@enron.com",
      "From: t..hodge@enron.com",
      "From: craig.buehler@enron.com"
    ]
  },
  "From: jordan.mintz@enron.com": {
    "test_samples": [
      [
        "Thank you, Jordan.",
        "Thanks. Jordan"
      ],
      [
        "Sally, thanks so much, Dan is going to meet with Tom on Monday.",
        "Sally: Thanks so much! Dan is meeting with Tom on Monday. Jordan"
      ]
    ],
    "val_samples": [
      [
        "Jordan was following up on the t/c from a couple of minutes ago.",
        "To followup on our t/c from a couple of minutes ago. Jordan"
      ],
      [
        "Thanks, Jordan, can you tell me if you've got a chance of getting the LC form?",
        "Thanks, Sara. Any luck on getting the LC form? Jordan"
      ],
      [
        "Sally, just a note to wish you good fortune on your new job. I always thought you had the toughest job in the company.",
        "Sally: Just a short note to congratulate you on your well-deserved promotion. I always thought you had the toughest job in the Company; I guess everybody else finally caught on! Jordan"
      ],
      [
        "We'll review it in light of the financings.",
        "Thanks; we'll review in light of the pipeline financings. Jordan"
      ]
    ],
    "target": [
      "From: mark.palmer@enron.com",
      "From: tim.belden@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: dan.bump@enron.com",
      "From: brandee.jackson@enron.com"
    ]
  },
  "From: judy.townsend@enron.com": {
    "test_samples": [
      [
        "tetco was correct, but do I need to change the ticket?",
        "sorry, tetco is right.... .035 Do I need to change the ticket?"
      ]
    ],
    "val_samples": [
      [
        "Call me if you want to see shanna's resume.",
        "Leah, here is shanna's resume. Call me. Judy - Shanna Boudreaux .doc - Backup of cover letter-gaspipe.wbk"
      ],
      [
        "This should be included to show you were managing wellheads while traders were taking short/long positions in the access area.",
        "You should include this and add that you were managing fluctuating wellheads while traders are taking short/long positions in the access area as well"
      ],
      [
        "You should add that you were managing intermittent wellheads while traders were taking short/long positions in the access area.",
        "You should include this and add that you were managing fluctuating wellheads while traders are taking short/long positions in the access area as well"
      ]
    ],
    "target": [
      "From: karolyn.criado@enron.com",
      "From: scott.stoness@enron.com",
      "From: shanna.funkhouser@enron.com",
      "From: roger.yang@enron.com",
      "From: wanda.curry@enron.com"
    ]
  },
  "From: k..heathman@enron.com": {
    "test_samples": [
      [
        "Gary Hickerson Pass Code is 1409, so you can dial in for domestic.",
        "Dial In for Domestic: 1-877-987-1409 Leaders Name: Gary Hickerson Pass Code: Gary"
      ],
      [
        "Per Rita, moved from Friday to Saturday and then back to Friday and then back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday and finally back to Saturday",
        "Per Rita, moved from Fri (3/23) to Mon (3/26)"
      ],
      [
        "On Monday, August 27th and Tuesday, August 28th I'll be out of the office, so please contact me if you need a meeting with Rick Buy.",
        "I will be out of the office on Monday, August 27th and will return on Tuesday, the 28th. If you need to schedule a meeting with Rick Buy, please contact Mercy Gil @ 3-5391. Thanks."
      ]
    ],
    "val_samples": [
      [
        "To be changed sometime in the future.",
        "To be rescheduled."
      ],
      [
        "There is a person here today, that is you, and you are working.",
        "Yes, you are working and Cassandra is here today."
      ],
      [
        "Gary Hickerson's Pass Code is Gary, and the operator will assist with the call.",
        "Dial 1-877-987-1409 Operator will assist with the call Leaders Name: Gary Hickerson Pass Code: Gary"
      ],
      [
        "Here are the travel arrangements for the trip with Andy, and your return from Boston/Houston.",
        "Rick, FYI--Here are the travel arrangements for the trip w/ Andy, including your return from Toronoto/Boston/Houston. Karen"
      ]
    ],
    "target": [
      "From: chris.dorland@enron.com",
      "From: mike.smith@enron.com",
      "From: brent.price@enron.com",
      "From: rhonda.denton@enron.com",
      "From: shanna.husser@enron.com"
    ]
  },
  "From: karolyn.criado@enron.com": {
    "test_samples": [
      [
        "If you have a question about the prices last weeks, please contact me.",
        "Please contact me if you have any questions regarding last weeks prices. Thank you, Karolyn Criado 3-9441"
      ],
      [
        "I would appreciate it if you could contact me with any questions about April pricing.",
        "Please contact me if you have any questions with April pricing. Thank you, Karolyn Criado 3-9441"
      ]
    ],
    "val_samples": [
      [
        "I am sorry, but I forgot to send out this yesterday, so I'm asking you to email me if you have any questions about last weeks prices.",
        "Hi all, I'm sorry, I forgot to send this out yesterday... please let me know if you have any questions regarding last weeks prices. Thank you, Karolyn Criado X39441"
      ],
      [
        "I'd like to hear from you if you have any questions about last weeks prices.",
        "Please contact me if you have any questions regarding last weeks prices. Thank you, Karolyn Criado 3-9441"
      ],
      [
        "If you have questions about last weeks prices, please contact me.",
        "Please contact me if you have any questions regarding last weeks prices. Thank you, Karolyn Criado 3-9441"
      ]
    ],
    "target": [
      "From: john.schwartzenburg@enron.com",
      "From: bill.rapp@enron.com",
      "From: craig.buehler@enron.com",
      "From: tim.belden@enron.com",
      "From: gtownsend@manorisd.net"
    ]
  },
  "From: kate.symes@enron.com": {
    "test_samples": [
      [
        "Amerex is correct, but the deal has been changed.",
        "Amerex is correct. Deal has been changed. Evelyn Metoyer@ENRON 01/16/2001 01:50 PM"
      ],
      [
        "I'd like to pass this along.",
        "Thought I'd pass this along....."
      ],
      [
        "Thanks for getting everyone together to spendAndy and Gray's money, I think it's time for things like that to happen more often.",
        "Thanks for taking the initiative to get everyone together in the spirit of spending Andy and/or Gray's money. Things like this need to happen more often, in my opinion. That's a picture of you in high school, right?"
      ],
      [
        "Veronica, thank you so much for your help.",
        "Thanks so much for your help, Veronica."
      ],
      [
        "I'll have Dave Poston fix it for you, and I'll get back to you.",
        "I'll have Dave Poston fix it and get back to you. Kate Melissa Ann Murphy 03/15/2001 01:49 PM"
      ]
    ],
    "val_samples": [
      [
        "We changed the year and strip by strip, but since it was originally entered in the deal blotter, it has those extra strips, and it should be right now.",
        "sorry - we changed the year and just changed each strip - but since it was originally entered in deal blotter it had those extra strips and, long story short, it should be right now. thanks Kate"
      ],
      [
        "Kate Stanley Cocke asked Stan if he needed to autoschedule the deals.",
        "Thanks for fixing that stuff, Stan. Do you need me to autoschedule the deals? Kate Stanley Cocke 04/19/2001 09:16 AM"
      ],
      [
        "Is that true?",
        "FYI -"
      ],
      [
        "It is with Natsource, part of a sleeve that Mike forgot to write down.",
        "It is with Natsource - part of a sleeve that Mike forgot to write down. Thanks, Kate Kerri Thompson@ENRON 11/16/2000 12:00 PM"
      ],
      [
        "Kate Lester Rawson finished on February 26, 2001 at 02:38 PM.",
        "Done. Kate Lester Rawson 02/26/2001 02:38 PM"
      ]
    ],
    "target": [
      "From: amy.copeland@enron.com",
      "From: lisa.yoho@enron.com",
      "From: gramlr@pjm.com",
      "From: susan.mara@enron.com",
      "From: exchangeinfo@nymex.com"
    ]
  },
  "From: kathleen.carnahan@enron.com": {
    "test_samples": [
      [
        "I will be working on this and I asked Kay and Carlos, Is Illinois Carlos' state?",
        "Kay and Carlos, Is Illinois Carlos' state? I will be working on this. Kathleen"
      ],
      [
        "If you need my help, just let me know, I'm not sure who your legal assistant is now.",
        "Jeff, Lisa called me today regarding this matter. I suggested she send you an e-mail with this request. I am not sure who your legal assistant is now, but if you need my help, just let me know. Kathleen"
      ],
      [
        "Do you want to take a look at the things I'm about to eat?",
        "I'm wolfing down some pasta and will be over as soon as I get through. Do you want to go over the stuff with me? Kathleen"
      ],
      [
        "There is another e-mail.",
        "Another endless e-mail."
      ],
      [
        "It is difficult to get into doing work related, so here is the URL for the Unclaimed Property site.",
        "Not bored, just having a hard time getting into doing anything work related. Here is the URL for the Unclaimed Property site. https://www.window.state.tx.us/unclprop/search.html"
      ]
    ],
    "val_samples": [
      [
        "It was the second meeting in 2 days.",
        "FYI - Second meeting in 2 days. Hmmm."
      ],
      [
        "I'll take care of this on Wednesday.",
        "I will take care of this on Wednesday. Thanks."
      ],
      [
        "I'm on 5.",
        "nope, I'm on 5"
      ],
      [
        "We can decide today if or not we need to sign the agreement.",
        "Can we decide some time today whether or not we need to sign the Escrow Fee Agreement?"
      ],
      [
        "She had a boy this morning at 8:00 Oregon time, but I don't know if I let him have it.",
        "She had a section this morning at 8:00 Oregon time. Did I let Dustin have it. It is a boy 8lbs 3 oz."
      ]
    ],
    "target": [
      "From: ted.evans@enron.com",
      "From: brent.price@enron.com",
      "From: harry.woodson@enron.com",
      "From: dan.leff@enron.com",
      "From: michelle.cash@enron.com"
    ]
  },
  "From: kay.chapman@enron.com": {
    "test_samples": [
      [
        "On February 16, 2001 at 01:00 PM,Peggy Mahoney of the EES was contacted by a person who wished to remain anonymous.",
        "Peggy Mahoney@EES 02/16/2001 04:59 PM"
      ],
      [
        "David W Delainey died on January 1st 2000, at the age of 66.",
        "David W Delainey 08/01/2000 06:30 PM"
      ],
      [
        "I'm trying to pull something together for Dave and Mark. I'd be happy to work for everyone on Tuesday, August 29th from 1:00 pm to 4:00 pm.",
        "I am trying to pull together a QBR for Dave and Mark Frevert. Would Tuesday August 29th from 1:00 pm to 4:00 pm. work for everyone? Thanks, Kay 3-0643"
      ],
      [
        "There is a company called Enron North America Corp.",
        "Enron North America Corp."
      ],
      [
        "The company is called Enron North America Corp.",
        "Enron North America Corp."
      ]
    ],
    "val_samples": [
      [
        "On 10/24/2000 Brown, Charles, \"cbrown@newportgen.com\"",
        "\"Brown, Charles\" <cbrown@newportgen.com> on 10/24/2000 03:34:58 PM"
      ],
      [
        "Thanks for your help, I'd like to be able to cancel the bloomberg program on my computer, but I'm not sure if you can direct me to the right person.",
        "Dave would like to cancel the bloomberg program that he presently has on his computer. Can you do this for him or can you direct me to the proper person ? Thanks for your help. Kay 713-853-0643"
      ],
      [
        "\"perfmgmt@enron.com\" was posted on 10/30/2000.",
        "\"perfmgmt@enron.com\"<perfmgmt on 10/30/2000 07:00:41 PM"
      ],
      [
        "The corporation is called Enron North America Corp.",
        "Enron North America Corp."
      ],
      [
        "David W Delainey was born on 11/12/2000 and passed away on 11/12/2000.",
        "David W Delainey 11/13/2000 10:55 AM"
      ]
    ],
    "target": [
      "From: david.parquet@enron.com",
      "From: horton@enron.com",
      "From: janel.guerrero@enron.com",
      "From: scott.stoness@enron.com",
      "From: taffy.milligan@enron.com"
    ]
  },
  "From: kay.mann@enron.com": {
    "test_samples": [
      [
        "My daughter gave this to me.",
        "This is from my daughter. ckm"
      ],
      [
        "I worked on two of the Illinois development sites that were sold. I'll let you know if there's anything you need to know.",
        "FYI. These is in essence the sale of two of the Illinois development sites that I worked on. I'll follow up. Kay"
      ],
      [
        "Here's the draft of the facility agreement and a memo for AK that were required to be reviewed by ABB.",
        "Here's the draft of the facility agreement that ABB has had to review, along with a memo for AK about certain questions. Kay"
      ],
      [
        "I'm not ready to send it to TECO yet, but I'm going to give you a look as soon as possible.",
        "I haven't read this yet, so it is not ready to be sent to TECO. Just wanted to give you a look as soon as possible. Kay"
      ],
      [
        "330ish looks good for both David and me, if you would like to call me, we can conference in David.",
        "Gregg, 330ish looks good for both David and me. If you would like to call me, we can conference in David. Thanks, Kay"
      ]
    ],
    "val_samples": [
      [
        "If you're interested, you can find it at http://www.victoria-house.com/lovers.",
        "http://www.victoria-house.com/lovers.html then browse!"
      ],
      [
        "We have a $6200 bill from them and we have no idea what to do with it.",
        "We have a $6200 bill from them. What's it for? Kay"
      ],
      [
        "Jake Thomas was signed for by us, so his signature is on the executed version.",
        "Looks good. Jake Thomas signed for us, so signature block on our executed version has him instead."
      ],
      [
        "That's right.",
        "FYI"
      ],
      [
        "Can you give me the name of the person we send the originals to?",
        "Can you tell me to whom we send the originals? Kay"
      ]
    ],
    "target": [
      "From: horton@enron.com",
      "From: steven@iepa.com",
      "From: gtownsend@manorisd.net",
      "From: anne.bike@enron.com",
      "From: lisa.connolly@enron.com"
    ]
  },
  "From: kim.theriot@enron.com": {
    "test_samples": [
      [
        "Is it possible that the paperwork was not received in time to change the agreement?",
        "Anthony Campos says that he has not received the paperwork on this in order to change the agreement. Has this actually happened and has the proper paperwork been received? Kim Theriot"
      ],
      [
        "Amerex June 5 had 10 power and 10 gas.",
        "Amerex June 5 Gas: 10 Power: 63"
      ],
      [
        "April 11 Power 50 Gas 23 Kim.",
        "Amerex- April 11 Power 50 Gas 23 Kim"
      ],
      [
        "The Amerex April 18 gas and power was 35 and 37, respectively.",
        "Amerex - April 18 Gas: 35 Power: 37"
      ]
    ],
    "val_samples": [
      [
        "May 25 Gas: 21 Power: 38 Amerex May 24 Gas: 29 Power: 57",
        "Amerex May 24 Gas: 29 Power: 57 May 25 Gas: 21 Power: 38"
      ],
      [
        "Kim theriot, let's know if the two guys from the Monterrey Mexico office are interested in this database and how they can track the progress of the master agreements.",
        "Jaime Williams and Agustin Perez in the Monterrey Mexico office expressed an interest in this database so that they could track the progress of the ISDA Master agreements for their counterparties. Let me know... Kim Theriot"
      ],
      [
        "Amerex June 4 Gas was 12 and Power was 51.",
        "Amerex June 4 Gas: 12 Power: 51"
      ],
      [
        "Amerex gas and power costs were 30 and 49 in the month of May.",
        "Amerex May 30 Gas: 30 Power: 49"
      ],
      [
        "There are no active deals under any of the \"Koch\" entities, which is why the Power business is currently conducted under a new formed entity.",
        "The Power business is currently conducted under new formed entity of Axia Energy, LP. There are no active deals under any of the \"Koch\" entities. Kim Theriot"
      ]
    ],
    "target": [
      "From: kathleen.carnahan@enron.com",
      "From: jordan.mintz@enron.com",
      "From: e..dickson@enron.com",
      "From: karolyn.criado@enron.com",
      "From: craig.buehler@enron.com"
    ]
  },
  "From: l..denton@enron.com": {
    "test_samples": [
      [
        "The executed EEI Master Power Purchase and Sale Agreement was given to us. Copies will be given to legal and credit.",
        "We have received the executed EEI Master Power Purchase and Sale Agreement dated 7/19/2001 from the referenced CP. Copies will be given to legal and credit."
      ],
      [
        "We have a bilateral in place if they are not on the credit watch list.",
        "If they are not on the credit watch list, we can. We have an old bilateral in place. If you do not receive the credit watch list, let me know and I will forward the latest."
      ],
      [
        "The executed EEI Master Power Purchase and Sale Agreements were sent to us, and they will be scanned into Livelink.",
        "We received the executed EEI Master Power Purchase and Sale Agreements dated 11/13/01 and 11/7/01, respectively, from the referenced CP. The documents will be scanned into Livelink."
      ],
      [
        "We received a copy of the EEI Master Power Purchase and Sale Agreement.",
        "We received the executed EEI Master Power Purchase and Sale Agreement dated 10/9/01 from the referenced CP. A copy will be scanned into Livelink."
      ],
      [
        "Contracts exist between the two companies, i.e., Enron Power Marketing and other companies.",
        "Yes, contracts exist between Enron Power Marketing and other Enron companies, i.e., Enron Wind Development, Enron North America, Enron Canada Corp., Enron Energy Services"
      ]
    ],
    "val_samples": [
      [
        "The executed EEI Master Power Purchase and Sale Agreement will be scanned into Livelink.",
        "We received the executed EEI Master Power Purchase and Sale Agreement dated 7/26/01 from the referenced CP. A copy will be scanned into Livelink."
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "The executed EEI Master Power Purchase and Sale Agreement was received by us and will be passed on to Legal and Credit.",
        "We have received the executed EEI Master Power Purchase and Sale Agreement dated 5/7/2001 from the referenced CP. Copies will be distributed to Legal and Credit."
      ],
      [
        "A copy of the executed EEI Master Power Purchase and Sale Agreement will be sent to us.",
        "We received the executed EEI Master Power Purchase and Sale Agreement dated 9/1/01 from the referenced CP. A copy will be scanned into Livelink."
      ],
      [
        "The executed EEI Master Power Purchase and Sale Agreement was sent to us.",
        "We received the executed EEI Master Power Purchase and Sale Agreement from the referenced CP dated 8/13/2001. A copy will be scanned into Livelink."
      ]
    ],
    "target": [
      "From: jeff.duff@enron.com",
      "From: john.allario@enron.com",
      "From: lisa.connolly@enron.com",
      "From: margaret.carson@enron.com",
      "From: lisa.yoho@enron.com"
    ]
  },
  "From: lara.leibman@enron.com": {
    "test_samples": [
      [
        "Enjoy!",
        "Enjoy!"
      ],
      [
        "Thank you so much for your assistance with this effort, I would like to mention the names of the individuals who I would like you to forward telecom information to: Matt Jachimiak and Patrick Lewis.",
        "The names of the individuals whom you should forward telecom information to are Matt Jachimiak and Patrick (William Patrick when you type in his name) Lewis. Again, thank you for assisting with this effort. I appreciate the help. Lara"
      ],
      [
        "The attached memo was written in response to EBS Legal's interest in doing business with the IRS, and it was provided to anyone interested in reading about federal contracting opportunities.",
        "For anyone interested in reading about federal contracting opportunities, attached below is a memo that Bracewell & Patterson did for EBS Legal in response to EBS's interest in doing business with the IRS. Thanks. Lara"
      ],
      [
        "I was going there.",
        "Thanks Al. I was going there."
      ],
      [
        "No problem -- I'm looking forward to it.",
        "no problem -- looking forward to it. Jeff Dasovich@ENRON Sent by: Jeff Dasovich@ENRON 10/31/00 04:21 PM"
      ]
    ],
    "val_samples": [
      [
        "Thanks for understanding, Jeff. will do next time.",
        "thanks for understanding jeff. will do next time round. best, lara Jeff Dasovich Sent by: Jeff Dasovich 10/20/2000 04:41 PM"
      ],
      [
        "Thanks, that's correct.",
        "FYI. Thanks. Lara"
      ],
      [
        "We filed our first comments on February 9th.",
        "Attached please find our initial comments that were filed on February 9th. Thanks. Regards, Lara"
      ],
      [
        "Thank you very much, Jeff Dasovich.",
        "Thank you darling. Jeff Dasovich 09/05/2000 03:20 PM"
      ],
      [
        "I don't know.",
        "fyi"
      ]
    ],
    "target": [
      "From: taffy.milligan@enron.com",
      "From: lisa.yoho@enron.com",
      "From: j.harris@enron.com",
      "From: roger.yang@enron.com",
      "From: rhonda.denton@enron.com"
    ]
  },
  "From: larry.may@enron.com": {
    "test_samples": [
      [
        "Yes, it's true.",
        "yes"
      ],
      [
        "That's fine.",
        "That's fine"
      ],
      [
        "I'm only able to buy options on EOL, so I need to be able to sell them.",
        "Please enable me to sell options on EOL (currently I am only able to buy). Thanks, Larry"
      ],
      [
        "Thanks for staying in touch, I will be happy to be used as a reference.",
        "Dear Sean, Thanks for staying in touch. Fell free to use me as a reference. Give me = a call : 713 853-6731. Good luck. Larry"
      ],
      [
        "Yes, I would agree with that.",
        "yes"
      ]
    ],
    "val_samples": [
      [
        "Frank, thanks for your kind words.",
        "Thanks Frank"
      ],
      [
        "We can find a conference room at 3pm today.",
        "how about today (Thurs) 3pm we can find a conference room"
      ],
      [
        "Looks good, thanks.",
        "Looks good thanks"
      ],
      [
        "If the flight is delayed I will give you a call, but it shouldn't be more than 1:45.",
        "2:15 would be good. My flight gets into Reagan at 12:00: if it is delayed I will give you a call. Thank you, Larry May"
      ],
      [
        "It was fair, thanks.",
        "Fair enough, Thanks"
      ]
    ],
    "target": [
      "From: sara.davidson@enron.com",
      "From: janel.guerrero@enron.com",
      "From: michelle.cash@enron.com",
      "From: rosalee.fleming@enron.com",
      "From: margaret.carson@enron.com"
    ]
  },
  "From: legalonline-compliance@enron.com": {
    "test_samples": [
      [
        "michellecash@enron.com is the email for the Office of the Chairman.",
        "To:CASH, MICHELLE Email:michelle.cash@enron.com - 7138536401 Enron Wholesale Services - Office of the Chairman"
      ],
      [
        "Mark was able to reach him by email at mark.e.haedicke@enron.com.",
        "To:HAEDICKE, MARK Email:mark.e.haedicke@enron.com - 7138536544 ? Enron Wholesale Services - Office of the Chairman ?"
      ]
    ],
    "val_samples": [
      [
        "? Email : tana.jones@enron.com if you are interested in learning more about the Office of the Chairman.",
        "To:JONES, TANA Email:tana.jones@enron.com - 7138533399 ? Enron Wholesale Services - Office of the Chairman ?"
      ],
      [
        "The email address of Gilmore- Smith, Doug, is: Gilmore-smith@enron.com.",
        "To:GILBERT-SMITH, DOUGLAS Email:doug.gilbert-smith@enron.com - 7138539310 Enron Wholesale Services - Office of the Chairman"
      ],
      [
        "Please respond to legalonline-compliance to Andrew, email andrew.h.lewis@enron.com",
        "Please respond to legalonline-complianceTo:LEWIS, ANDREW Email:andrew.h.lewis@enron.com - 7138536278 Enron Wholesale Services - Office of the Chairman"
      ]
    ],
    "target": [
      "From: f..calger@enron.com",
      "From: sylvia.hu@enron.com",
      "From: jennifer.thome@enron.com",
      "From: lexi.elliott@enron.com",
      "From: kathleen.carnahan@enron.com"
    ]
  },
  "From: lexi.elliott@enron.com": {
    "test_samples": [
      [
        "The UT MBA recruiting team will hold a meeting on Thursday, September 6 at 9:30 a.m.",
        "Please join the UT MBA recruiting team for a kickoff meeting : Thursday, September 6 9:30 a.m. EB 20C2 We will discuss recruiting details and finalize participation for our campus events"
      ]
    ],
    "val_samples": [
      [
        "Please call and let me know if Matthew has accepted our full-time offer.",
        "Matthew Olney has accepted our full-time offer! Please call (405/360-0311) and congratulate him. thank you, lexi 3-4585"
      ],
      [
        "Attached is the copy of the presentation that will be given to you on the campus for your review.",
        "Dear Team: Attached is a copy of the presentation to be given on campus for your review. Thank you! Lexi 3-4585"
      ],
      [
        "Sally/Patti: I would like to send the event sheets in the event that you are able to find replacements.",
        "Sally/Patti: I wanted to send the event sheets in the case that you are able to find replacements. Thank you! lexi"
      ]
    ],
    "target": [
      "From: t..hodge@enron.com",
      "From: christi.nicolay@enron.com",
      "From: amanda.rybarski@enron.com",
      "From: kay.chapman@enron.com",
      "From: brent.price@enron.com"
    ]
  },
  "From: lillian.villarreal@enron.com": {
    "test_samples": [
      [
        "There are no significant issues and several key players are not in the office, so the meeting won't take place today.",
        "The meeting originally schedule for 3pm today will not take place. There are no significant issues and several key players are out of the office. Thank you."
      ],
      [
        "The time and date have been revised.",
        "Revised Date & Time"
      ],
      [
        "On Friday, we will be holding our regular Ops Cmte Mtg.",
        "We will be holding our regular Ops Cmte Mtg on Friday, 6/29"
      ],
      [
        "I can give you some info that you might be able to use if you want to, but they are not the ones you are looking for.",
        "Geneva, I am forwarding the docs that I have, that pertain to Enron Kids. They may not be the ones you are looking for, but may provide some info you can use."
      ]
    ],
    "val_samples": [
      [
        "There is an operations meeting for contracts and capacity release.",
        "Operations Kickoff meeting for Contracts & Capacity Release"
      ],
      [
        "I need to send the EIA announcement in, but I want you to review it first.",
        "Please review the announcement for EIA before I send it in."
      ],
      [
        "The January edition of the ETS IT newsletter can be found on our website at http://www.ets.enron.com/ITNewsletter.",
        "Please visit our January edition of the ETS IT newsletter at: http://www.ets.enron.com/ITNewsletter/"
      ],
      [
        "The project progress and issues can be addressed by Ops Cmte Mtg.",
        "Ops Cmte Mtg to address project progress and issues"
      ],
      [
        "If you want to see where we are next week, we have a room that will be open from 11:30 to 1pm on 11/29.",
        "We have a room scheduled for 11/29 from 11:30 - 1pm if we want to have a mtg next week to see where we are at. Please let me know if you want to do that. LV"
      ]
    ],
    "target": [
      "From: lara.leibman@enron.com",
      "From: john.valdes@enron.com",
      "From: shanna.funkhouser@enron.com",
      "From: kay.chapman@enron.com",
      "From: dave.scott@enron.com"
    ]
  },
  "From: linda.noske@enron.com": {
    "test_samples": [
      [
        "Just in case, it is not sure if you need this one.",
        "Not sure if you need this one but forwarding just in case."
      ],
      [
        "You can see pictures from the law conference.",
        "ENJOY! PICTURES FROM LAW CONFERENCE THAT MICHELLE CASH TOOK."
      ]
    ],
    "val_samples": [
      [
        "Please reserve the dates on your calendar for the ENA Legal Conference that will be held in October 2000 at The Woodlands Resort and Conference Center.",
        "Please reserve the following dates on your calendar for the ENA Legal Conference that will be held at the Woodlands Resort and Conference Center this year: October 5 & 6, 2000 Details to follow at a later date."
      ],
      [
        "Christi Nicolay was the person from which the letter was derived.",
        "From Christi Nicolay"
      ],
      [
        "Please call me immediately if you found it, it is missing since yesterday.",
        "Please call me immediately if you have found one. Missing since yesterday. It is a Houston Cellular telephone. Thanks!!! X36082"
      ],
      [
        "If you will be attending the dinner via email, please let me know so I can make a rooming list for you.",
        "Sorry, but for headcount purposes, please let me know if you \"will\" be attending the dinner via e-mail. THANK YOU! Also, a \"revised\" Agenda and Rooming List will be forwarded to you soon."
      ]
    ],
    "target": [
      "From: shanna.husser@enron.com",
      "From: archiving@enron.com",
      "From: michelle.cash@enron.com",
      "From: larry.may@enron.com",
      "From: l..denton@enron.com"
    ]
  },
  "From: lisa.connolly@enron.com": {
    "test_samples": [
      [
        "Please review the attached document and let me know if I missed anything.",
        "Please review, prior to our conference call tomorrow, the attached document summarizing the Screening Committee's efforts to date (especially the recruiting effort section). Please let me know if I have missed anything here. Thanks, Lisa"
      ],
      [
        "Suggestions, comments, and comments from other members of the committee?",
        "Comments, suggestions from other committee members?"
      ]
    ],
    "val_samples": [
      [
        "Suggestions from other committee members are being asked to provide Comments, suggestions on suggestion from other committee members are being asked to provide",
        "Comments, suggestions on suggestion below from other committee members?"
      ],
      [
        "The event is scheduled for Friday, June 1, 2001, at 6 pm at Tasca's, 908 Congress St.",
        "Date: Friday, June 1, 2001 Time: 6pm Place: Tasca's, 908 Congress St. Valet parking is available. See you then, Lisa"
      ]
    ],
    "target": [
      "From: jeff.duff@enron.com",
      "From: rob.walls@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: shanna.funkhouser@enron.com",
      "From: j.harris@enron.com"
    ]
  },
  "From: lisa.gang@enron.com": {
    "test_samples": [
      [
        "I entered an annuity amount for the month of November and the month of October.",
        "I entered an annuity amount of $1,345.50 for the month of November and part of October. The Enpower #883315. lisa"
      ],
      [
        "The schedule for the state of California was published in 2002.",
        "P:SCHEDULING:2002:MARCH:Scheduling California"
      ],
      [
        "Hello, Lisa, that is HELLO, I'd like to ask you, what are you doing, what are you doing, what are you doing, I'd like to ask you, what are you doing, what are you doing, I'd like to ask you,",
        "HELLO?????? LISA"
      ],
      [
        "Thank you!",
        "THANK YOU!"
      ],
      [
        "Thank you, Lisa!",
        "THANK YOU! LISA"
      ]
    ],
    "val_samples": [
      [
        "I'll see what you think when I meet you at your house.",
        "DUDE, I'LL MEET YOU AT YOUR HOUSE. I WANT TO SEE WHAT IT LOOKS LIKE."
      ],
      [
        "For a moment, Lisa, I need you.",
        "I NEED YOU FOR A MOMENT.. LISA"
      ],
      [
        "Thank you, Lisa, for your kind words, I'll look forward to your reply.",
        "Thank you. I will look forward to your response. Lisa"
      ],
      [
        "Are we going to have that drink?",
        "MSN..WASSS UP???WHEN ARE WE GOING TO HAVE THAT DRINK??"
      ],
      [
        "Thank you, you are the best.",
        "thanks, you are the best."
      ]
    ],
    "target": [
      "From: robert.hayes@enron.com",
      "From: lisa.yoho@enron.com",
      "From: susan.mara@enron.com",
      "From: exchange.administrator@enron.com",
      "From: gtownsend@manorisd.net"
    ]
  },
  "From: lisa.yoho@enron.com": {
    "test_samples": [
      [
        "It's been a privilege to work with each of you, and I know things are crazy, but stop by if you can.",
        "I know things are crazy, but stop by if you can. You are top notch lawyers, and it's been a privilege to work with each of you. Lisa"
      ],
      [
        "When you have time, I'll sit down with Mark to talk about this.",
        "Sound familiar? Let's sit down with Mark on this when you have time. Tha= nks, Lisa"
      ],
      [
        "Thank you for your help, Larry.",
        "Larry: This is an excellent memo. Thank you very much for your help. Lisa Larry Decker 06/28/2001 05:37 PM"
      ],
      [
        "Please review and get back to me with your comments, Lisa.",
        "Mark: Please review and get back to me asap with comments. THANKS Lisa"
      ],
      [
        "The budget scenarios are based on our meeting this morning with Jeff and Ray.",
        "Based on our meeting this morning with Jeff and Ray, attached are my revised budget scenarios. I have changed the way I would implement a 40% reduction. Thanks, Lisa"
      ]
    ],
    "val_samples": [
      [
        "The new org chart for EGM is attached.",
        "FYI -- attached is the new org chart for EGM. Lisa"
      ],
      [
        "Steve Huntoon, who is now with Dynegy's DC office wrote \"ISO California\" at the end of this email, thought you might get a kick out of it.",
        "Thought you might get a kick out of \"ISO California\" (at the end of this=20 email) written by Steve Huntoon, who is now with Dynegy's DC office. --= =20 Lisa"
      ],
      [
        "I wanted to let you know that we're working with the London EIM team to provide information on regulatory and trade issues.",
        "Rick - FYI. I wanted you to know that we're working with the London EIM team to provide information on regulatory / trade issues. Thanks. Lisa"
      ],
      [
        "Chris and Tom are working on summaries of their own.",
        "FYI. Chris and Tom are working on a summary as well. Lisa"
      ],
      [
        "I would like to get together with Mark to discuss how we can coordinate matters related to the Commodity Future Trading Commission.",
        "Mark -- Are you in this week? I'd like to get together to discuss how we can best coordinate CFTC - related matters. Thanks!! Lisa"
      ]
    ],
    "target": [
      "From: rosalee.fleming@enron.com",
      "From: jeff.brown@enron.com",
      "From: dave.scott@enron.com",
      "From: sue.nord@enron.com",
      "From: shanna.funkhouser@enron.com"
    ]
  },
  "From: lorna.brennan@enron.com": {
    "test_samples": [
      [
        "If you missed the conference call, you can replay the 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846",
        "If you missed the CERA conference call on Gas Prices, you can listen to the replay or view the web version by followiing the instructions below. Lorna"
      ],
      [
        "There is a short study on the effect of the CA decision on distributed energy strategy.",
        "Note: Short Study from CERA on effect of CA decision on distributed energy strategy. LB"
      ],
      [
        "The monthly CERA report has been published.",
        "Monthly CERA report:"
      ],
      [
        "You can replay the call if you didn't attend on Monday.",
        "If you were not able to attend the call on Monday. You can listen to it via replay if you want. Just follow the instructions below. Lorna"
      ],
      [
        "You weren't given a chance to listen in on the conference call.",
        "For those of you that did not get a chance to listen in on the conference call. Lorna"
      ]
    ],
    "val_samples": [
      [
        "Let me know if you want to attend the conference call, I'll register you.",
        "If you want to attend this conference call, please let me know. I will register us. Thanks. Lorna"
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "I will register us if anyone wants to sit in on this.",
        "Does anyone want to sit in on this? Let me know and I will register us."
      ],
      [
        "There is an overview of markets, prices and supply in the attached Monthly analysis of markets, prices and supply.",
        "Attached is the monthly CERA analysis of markets, prices and supply."
      ],
      [
        "Were you able to see this?",
        "Did you see this? Lorna"
      ]
    ],
    "target": [
      "From: exchange.administrator@enron.com",
      "From: e..dickson@enron.com",
      "From: allison.navin@enron.com",
      "From: taffy.milligan@enron.com",
      "From: lisa.connolly@enron.com"
    ]
  },
  "From: louis.dicarlo@enron.com": {
    "test_samples": [
      [
        "General Mills paid the full amount of the demand letter on April 3, 2002, and I didn't receive this email yesterday.",
        "I missed General Mills on this email yesterday. General MIlls paid on 3/4/02 for the full demand letter amount"
      ],
      [
        "The volume file is here.",
        "Geof, here's the volume file."
      ],
      [
        "I'm not sure if you mean that financial are mostly 2-way but a few are 1-way.",
        "I thought you've been saying Financial are largely 2-way but a few are 1-way and we would need to check for those. Now \"financial contracts are 1-way.\" I'm confused."
      ]
    ],
    "val_samples": [
      [
        "The email shows how the payment was made by BG&E.",
        "The attached email details the payment made by BG&E."
      ],
      [
        "Below is a list of my name columns.",
        "See below including my counterparty name column."
      ],
      [
        "Please get A.K. to see if she has made any progress on this. If you have questions, please let me know.",
        "Chris, please get w/ A.K. to determine if she has made any progress on this. Let me know if you have questions. Thanks"
      ],
      [
        "If you can, please add the DLL to reflect that they are paid in full.",
        "Susan: See Angelo's note below. Please update the DLL to reflect that they are paid in full. Thanks"
      ],
      [
        "There were a few people that didn't get the reply.",
        "Oops, missed a few folks on the reply. Sorry. See note below."
      ]
    ],
    "target": [
      "From: craig.buehler@enron.com",
      "From: tim.belden@enron.com",
      "From: lexi.elliott@enron.com",
      "From: brent.price@enron.com",
      "From: aleck.dadson@enron.com"
    ]
  },
  "From: margaret.carson@enron.com": {
    "test_samples": [
      [
        "Margaret is going to have more to come.",
        "..more to come. Margaret"
      ],
      [
        "A great heads up on Alliance.",
        "A good heads up on Alliance..Margare"
      ],
      [
        "Rob Bradley has a copy of a slide show about winter and remedies for volatility in the market.",
        "There are some useful slides in here on the upcoming winter and remedies for volatility in the market . Rob Bradley has a copy. Margaret"
      ]
    ],
    "val_samples": [
      [
        "If you haven't seen Margaret, then this is for you.",
        "In case you have not seen.....Margaret"
      ],
      [
        "Margaret might be interested in this upcoming call and Q and A.",
        "This upcoming call and Q AND A may be of interest. Margaret"
      ],
      [
        "Margaret, I appreciate all your help.",
        "I appreciate all your great help ...merci beaucoup Margaret Carson"
      ],
      [
        "There were some tough questions asked of Jeff about the session on gas.",
        "Jeff How did the session on gas go? Any tough questions? This Cambaridge Energy report addresses Calif. and Rockies/ SJB basis in the last 20 percent of the document...fyi Margaret"
      ],
      [
        "Attached is a look at recent gasoline, natural gas and electric price swings and trends for the next year out, in response to your request.",
        "Attached in response to your request from Irvin Stelzer and Bob Zellig is the look at recent gasoline, natural gas and electric price swings and trends for the next year out. Let me know if this does the trick. Margaret"
      ]
    ],
    "target": [
      "From: wes.colwell@enron.com",
      "From: t..hodge@enron.com",
      "From: paula.rieker@enron.com",
      "From: mary.cook@enron.com",
      "From: ricki.winters@enron.com"
    ]
  },
  "From: mark.palmer@enron.com": {
    "test_samples": [
      [
        "Is it a good idea to think?",
        "whaddaya think?"
      ],
      [
        "You have to see this in case you haven't already.",
        "In case you haven't already seen this... Mark"
      ],
      [
        "Wordsmithing has been intense, but last minute, this was sent to Jeff, Mark, Paula, and Rex.",
        "sent this to Jeff, Mark and Paula, and Rex. last minute, but the wordsmithing has been intense. Mark"
      ],
      [
        "We are going to release it at 2:30 pm CDT unless I change my mind.",
        "this draft incorporates comments from Greg Whalley and Jeff Skilling. Unless I hear differently, we will release it at 2:30 pm CDT. Mark"
      ],
      [
        "This is an excellent article that can be found on the Fool's web site.",
        "check out this excellent article on the Motley Fool web site. http://www.fool.com/news/2000/foth000209.htm"
      ]
    ],
    "val_samples": [
      [
        "Use as you see fit, with the exception of the removal of the mention of Enron in the Opinion Elite Survey Summary.",
        "Here is the Opinion Elite Survey Summary, with Enron mentions removed. Use as you see fit. Mark"
      ],
      [
        "The Annual Report of the year was the first thing I thought of.",
        "First, the Annual Report of the year, and now, this. And I thought"
      ],
      [
        "The communications materials related to PGE's settlement of cost recovery issues are attached.",
        "attached are communications materials related to PGE's settlement of Trojan cost recovery issues."
      ],
      [
        "It's not as bad as originally reported, but media interest isn't very high.",
        "As usual, not as bad as originally reported. Note that media interest is minimal. Mark"
      ],
      [
        "It's fyi.",
        "fyi"
      ]
    ],
    "target": [
      "From: c..williams@enron.com",
      "From: paula.rieker@enron.com",
      "From: sara.davidson@enron.com",
      "From: carlos.alatorre@enron.com",
      "From: janel.guerrero@enron.com"
    ]
  },
  "From: mary.cook@enron.com": {
    "test_samples": [
      [
        "Thank you, please handle.",
        "Please handle."
      ],
      [
        "I am wondering if Barbara has time to deal with this one since it is of high importance.",
        "Marie, I note this was unassigned, I guess Carol was trying to cover this. Please see if Barbara has time to handle this one since it is of high importance."
      ],
      [
        "Please give us the Canadian conversion language for the Canada public Raptor deals.",
        "You will provide Tana and I with the Canadian conversion language for the Canada public Raptor deals. Thanks!"
      ],
      [
        "I have placed a call to Joe to find out the current status of the confirmations that he sent to us.",
        "As of 7/20 Joe said we had sent them our confirm and to hold the ones he sent to us. Although I have not heard back from him, I have placed a call to Joe to determine current status. Mary"
      ],
      [
        "I don't have them yet. Marie, will you have them? Mary H. studied them in the PGE master netting agreement.",
        "I do not have them yet. Marie, will you have these entities (as noted in the PGE master netting agreement) researched by Mary H."
      ]
    ],
    "val_samples": [
      [
        "If you have not seen this one yet, it is really fun and we need some laughs.",
        "Just in case you had not seen this one!!!! TOO FUNNY! We need some laughs and here they are!"
      ],
      [
        "I am going to review the matters with my friend, Tana, after class.",
        "I am in class until 4:30. I will review the Engage matters following class with Tana. Mary"
      ],
      [
        "Mary will need to leave at 5 pm to retrieve William from after school.",
        "This Wednesday I will need to leave at 5:30 to retrieve William from after school. Mary"
      ],
      [
        "It was last done by Flynn and St. Clair,TrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkiaTrademarkia",
        "Do you have this file? It was last being worked by Flynn and St. Clair. Thanks for looking. Mary"
      ],
      [
        "Please verify that the lines you are aware of are on the attached list.",
        "Please check the attached list to confirm that these are all the lines we have of which you are aware. Thanks Mary"
      ]
    ],
    "target": [
      "From: margaret.carson@enron.com",
      "From: susan.mara@enron.com",
      "From: ricki.winters@enron.com",
      "From: houston",
      "From: lexi.elliott@enron.com"
    ]
  },
  "From: michael.brown@enron.com": {
    "test_samples": [
      [
        "The Wartsila guys didn't cause the problem according to John, but they haven't been straight with us.",
        "John , seems that the Wartsila guys have not been straight with us , your guys didn't cause the problem . Thanks michael"
      ]
    ],
    "val_samples": [
      [
        "Please review the changes and let me know if you think the changes make sense.",
        "Please review the changes to our confirmation. It is my understanding the intent of the changes are to clearify that the option is \"Daily\" and settles \"Monthly\". Once received & reviewed please contact me at X31930 mb"
      ],
      [
        "We need to refer to other areas we talked about or just state that there will be a later announcement covering those.",
        "This requires a bit of work , but is along the right lines . Please let me have any comments . Rick we need to refer to the other areas we talked about or just state that there will be a later announcement covering those , Michael"
      ],
      [
        "Michael, I'm very proud of you.",
        "FYI Michael"
      ]
    ],
    "target": [
      "From: nony.flores@enron.com",
      "From: roger.yang@enron.com",
      "From: a..shankman@enron.com",
      "From: anne.bike@enron.com",
      "From: k..heathman@enron.com"
    ]
  },
  "From: michelle.cash@enron.com": {
    "test_samples": [
      [
        "It was a very good response, I thought.",
        "Very good response!!! It struck the right chord, I thought. MHC"
      ],
      [
        "This is at 12:30 Central Time, I assume?",
        "I got this. I assume this is 12:30 Central Time?"
      ],
      [
        "Here is a confidential legal memo about the Garden State modification of operations.",
        "Hoyt, Here is a privileged and confidential legal memorandum regarding the Garden State modification of operations. Let's discuss these issues tomorrow or Friday. Michelle"
      ],
      [
        "This is fine, but is it too harsh?",
        "This is fine, but is it harsh enough?"
      ],
      [
        "If you would like to attend, please let me know.",
        "FYI if you would like to attend. Michelle"
      ]
    ],
    "val_samples": [
      [
        "Is it possible that companies with large ownership interests that don't have a Subsidiary could be considered a \"subsidiary\"?",
        "Aaron, does this apply to companies in which we have a large ownership interest, but that may not be a \"subsidiary\"? Thanks. Michelle"
      ],
      [
        "I have to wait until I get the package from PR.",
        "I'm holding off on these until I get the package from PR."
      ],
      [
        "Rick, there is a status meeting at 10:00 am today, and I hope you can participate by phone.",
        "Rick, FYI. Also, there is a status meeting at 10:00 today -- I don't know if you got message, but I hope you can participate by phone. Michelle"
      ],
      [
        "We have to get those approved first.",
        "Unfortunately, no. We have to get those approved by creditors here first. Bummer. Michelle Merry Christmas!"
      ],
      [
        "It was too efficient.",
        "Oops -- too efficient."
      ]
    ],
    "target": [
      "From: steven.harris@enron.com",
      "From: l..denton@enron.com",
      "From: john.valdes@enron.com",
      "From: lillian.villarreal@enron.com",
      "From: wanda.curry@enron.com"
    ]
  },
  "From: mike.smith@enron.com": {
    "test_samples": [
      [
        "The attached is the communication between the attorney and his client.",
        "ATTORNEY CLIENT PRIVILEGED COMMUNICATION Please see the attached. MDS"
      ],
      [
        "It's true.",
        "FYI"
      ],
      [
        "Marianne castano, the EES lawyer, is in the loop on this.",
        "Please keep marianne castano in the loop on this--she is the EES lawyer han= dling. MDS"
      ],
      [
        "Scott Gahn, Mary, and me should be in there.",
        "I agree. These changes from Mary, Scott and me should be in there. MDS Scott Gahn 02/06/2001 04:41 PM"
      ],
      [
        "I would like to thank you for the great input.",
        "Thanks. Comments below. Great input."
      ]
    ],
    "val_samples": [
      [
        "We can carve out some time between 10:30 and 11 to do this, but Jeff is looking for a way to do this at noon.",
        "Jeff--I have another matter slotted in at 11. Any way we can do this at noon? Perhaps we can carve out a bit of time between 10:30 and 11?"
      ],
      [
        "Bo told me to attach the latest version of the master agreement.",
        "Per Bo's instruction, attached is the latest version of the master agreement."
      ],
      [
        "We need to talk before this goes out, a new issue has surfaced this morning that may impact this.",
        "Here is the EES info to be sent to the PUC. Gary & Mike--we need to talk before this goes out. A new issue has surfaced this morning which may impact this. Please call. MDS"
      ],
      [
        "It would be wonderful if you could help us think through legislative issues by joining us on our internal call tomorrow at 2.",
        "Jeff--it would be great if you could be on the internal call tomorrow at 2 to help us think through legislative issues, including AB X 27. Any chance we can get a spot of your time?"
      ],
      [
        "I'd appreciate it if you changed my name to \"mike d. smith\".",
        "Jeff--please change my name to \"mike d. smith\" Thanks"
      ]
    ],
    "target": [
      "From: clement.abrams@enron.com",
      "From: shanna.husser@enron.com",
      "From: brandee.jackson@enron.com",
      "From: mark.palmer@enron.com",
      "From: horton@enron.com"
    ]
  },
  "From: monika.causholli@enron.com": {
    "test_samples": [
      [
        "Do you know when I will be able to get tickets for the RISI conference in San.Diego?",
        "Nyree, Can you wait until next week before you get my tickets to RISI conference in San.Diego? thanks, Monika"
      ],
      [
        "I made an appointment there.",
        "Thanks Andrea, I made an appointment there. Monika"
      ],
      [
        "Let me know if you can meet on Monday at 2:30 pm to discuss the format of the newsletter.",
        "Laura, Do you have time on Monday at 2:00 pm to meet together and discuss newsletter format? let me know Monika"
      ],
      [
        "Thanks for that!",
        "Thanks Peggy!"
      ],
      [
        "Is it possible to freeze panes twice in the same spreadsheet?",
        "Vik, Do you know how to freeze panes twice in the same spreadsheet? MOnika"
      ]
    ],
    "val_samples": [
      [
        "I received an email from a friend of mine, and I attached the report on Sappi.",
        "Karen, Attached is the report on Sappi. Also, I just received the email from Peggy on Weyerhaeuser. Thanks, Monika"
      ],
      [
        "I haven't worked on the side yet because I have been in a class.",
        "Sorry Laura, I I have been away in a class and have not worked on that side yet. Monika"
      ],
      [
        "I'm an analyst working at EIM in Houston, and I was wondering if I could be included on the distribution list for the bi-weekly Pulp newsletter.",
        "Hello, I am an analyst working at EIM fundamentals in Houston and was wondering if I could be included in the distribution list that receives the bi-weekly Pulp newsletter. thanks, Monika Causholli"
      ],
      [
        "Thank you very much, we're going to give it a try.",
        "Thank you very much. We will give it a try."
      ],
      [
        "The tables on demand indicators have been updated.",
        "Dirk, Attached are the updated tables on Demand Indicators. MOnika"
      ]
    ],
    "target": [
      "From: rob.walls@enron.com",
      "From: michelle.cash@enron.com",
      "From: l..denton@enron.com",
      "From: amy.fitzpatrick@enron.com",
      "From: christi.nicolay@enron.com"
    ]
  },
  "From: n..gray@enron.com": {
    "test_samples": [
      [
        "Gerald may be able to give an example.",
        "Gerald Nemec may be able to provide an example . b ng"
      ],
      [
        "Attachments to this forwarded message were referred to in my previous email.",
        "email I referred to in previous email....see attachments to this forwarded message many thax"
      ],
      [
        "I handled this a few weeks ago, and you can just destroy the email, and get on with your life.",
        "Mark, I handled this some weeks ago....you may gleefully delete the email and take the matter out of your mental que......bng"
      ]
    ],
    "val_samples": [
      [
        "The receptionist is on the 16th floor.",
        "zoolie florez receptionist on 16th floor for delivery to Pam Butler"
      ],
      [
        "If this is not good for you, please advise, I have put you on my calendar for 10:00.",
        "I've put you on my calendar for 10:00....if this is not good for you, please advise. Have a good weekend....bng"
      ],
      [
        "Attached is the License and Service Agreement \"3rd Party Posting Agreement\" for Swapco, for you to review and revision to the extent that you think is necessary.",
        "Attached hereto is the License and Service Agreement (\"3rd Party Posting Agreement\") for Swapco, for your review and revision to the extent you think necessary. Best Regards, Barbara Gray"
      ],
      [
        "We will have an answer by tomorrow afternoon, Brian, Gerald and I are already working on it.",
        "Brian, Gerald and I are already in process on this...we will have an answer by tomorrow afternoon.....bng"
      ]
    ],
    "target": [
      "From: john.schwartzenburg@enron.com",
      "From: scott_gardner@pgn.com",
      "From: john.forney@enron.com",
      "From: mark.palmer@enron.com",
      "From: houston"
    ]
  },
  "From: nony.flores@enron.com": {
    "test_samples": [
      [
        "The spreadsheet prepared by Tom Moran is here.",
        "Sara, Here is the spreadsheet prepared by Tom Moran."
      ],
      [
        "Attached is the list of E GM companies that you requested.",
        "Sara, As per your request, attached is the list of EGM companies. Thanks. Nony"
      ]
    ],
    "val_samples": [
      [
        "Marie, please assign to John Viverito.",
        "Marie - FYI. Please assign to John Viverito. Nony"
      ],
      [
        "We got an agreement yesterday from Valero and we want to give it to Jay Wiliams for further handling.",
        "Marie, FYI. Yesterday we received a netting agreement from Valero and delivered it to Jay Wiliams for further handling. Please add the list of negotiations and assign it to John Viverito. Thanks. Nony"
      ],
      [
        "I will follow up with Tom Moran tomorrow after sending a reminder to him today.",
        "Susan, Nothing yet. I sent a reminder to Tom Moran today and will follow up with him tomorrow. Thanks. Nony"
      ]
    ],
    "target": [
      "From: harry.woodson@enron.com",
      "From: clement.abrams@enron.com",
      "From: jennifer.thome@enron.com",
      "From: amy.fitzpatrick@enron.com",
      "From: shanna.husser@enron.com"
    ]
  },
  "From: paul.cherry@enron.com": {
    "test_samples": [
      [
        "I wanted to know if the revised payment instructions for the December 31st wire had been sent.",
        "Herb, I wanted to follow up to determine if the revised payment instructions for the December 31st wire of $ 1.6M had been sent. Thanks."
      ]
    ],
    "val_samples": [
      [
        "It was approved.",
        "Approved."
      ],
      [
        "It's true.",
        "FYI"
      ],
      [
        "It was approved.",
        "Approved."
      ]
    ],
    "target": [
      "From: jeff.duff@enron.com",
      "From: horton@enron.com",
      "From: e..dickson@enron.com",
      "From: richard.hrabal@enron.com",
      "From: john.valdes@enron.com"
    ]
  },
  "From: paula.rieker@enron.com": {
    "test_samples": [
      [
        "Join the meeting in Greg's office at 4:15PM today to discuss management's recommendation to the Board of Directors on Project Southwood.",
        "Pls. join a meeting in Greg's office today at 4:15 p.m. today to discuss management's recommendation to the Board of Directors on Project Southwood. Thanks. Paula"
      ],
      [
        "Frank's note says that all the directors are very grateful to Ken for all he's done for them.",
        "Ken - As Frank's note says below, all the directors are very grateful to you for all you have done for each of us. Your leadership has been invaluable. Thank you. My best, Paula"
      ],
      [
        "I was waiting for a clear \"go\" from Ken, so I asked Jim if there was a need for a Board meeting tomorrow.",
        "Jim - Pls. advise if we need to set up a Board meeting for tomorrow. I know it might be necessary to re-vote and was waiting for a clear \"go\". I have not heard from Ken. Thanks, Paula"
      ],
      [
        "I will have my pager with me, and I will be able to be reached at: 830 935 4858 during the Thanksgiving holiday.",
        "During the Thanksgiving holiday, I can be reached at: 830 935 4858 In addition, I will be checking voicemail and will have my pager with me: 800 957 8467 Happy Thanksgiving to each of you!"
      ]
    ],
    "val_samples": [
      [
        "The option number should have been more than $250,000, for a total comp package of $384,000.",
        "Jim - The option number was previously understated - should have been $252,010, for a total avg. comp. package of $384,000 in 2000. Separately, I will forward document you may send externally."
      ],
      [
        "The responses to the NY Times with Rex may have been coordinated by PR, but they may not have received legal advice, according to Mark Palmer.",
        "Jim - Mark Palmer has confirmed PR has coordinated the responses to the NY Times with Rex, although they may have been asked questions \"on the fly\" that did not receive direct legal input but PR used legal guidance in responding. PHR"
      ],
      [
        "Please advise if you have other handouts to give to the BoD on Sunday.",
        "Pls. advise if you have other handouts for the BoD mtg. on Sunday"
      ],
      [
        "E-Mail: kelly.johnson@enron.com, fax: 713-853-6485, or mail: Kelly M. Johnson, Executive Assistant, Enron Corp.",
        "Kelly M. Johnson Executive Assistant Enron Corp. Tel: 713-853-6485 Fax: 713-853-2534 E-Mail: kelly.johnson@enron.com"
      ]
    ],
    "target": [
      "From: richard.hrabal@enron.com",
      "From: wes.colwell@enron.com",
      "From: sara.davidson@enron.com",
      "From: kate.symes@enron.com",
      "From: exchange.administrator@enron.com"
    ]
  },
  "From: peter.keavey@enron.com": {
    "test_samples": [
      [
        "October 20, 2000 and December 29, 2000 should be put on the schedule as vacation days.",
        "please put Oct 20,2000 and Dec 29, 2000 on the schedule as vacation days Thanks"
      ],
      [
        "Good luck.",
        "Good luck."
      ],
      [
        "The framework can be found on theenaresearch.corp.enron.com.",
        "http://enaresearch.corp.enron.com/research/framework/default.asp"
      ],
      [
        "You will need to confirm the offsetting trades for the financial swap and the phys swap.",
        "I put in an offsetting trade for the phys/financial swap. You will have to process three confirmations to get it done 2 offsetting phys and 1 financial. Pete"
      ],
      [
        "I would need a starting receiver for Rickey as part of the package if he was available for the right price.",
        "Rickey is always available for the right price i would need a starting WR for him though as part of the package"
      ]
    ],
    "val_samples": [
      [
        "I am interested in the seats, can you tell me if you still have them?",
        "Gary, I am interested in the Cincy seats. Let me know if you still have them"
      ],
      [
        "I'm wondering if there's any luck in getting me set up.",
        "any luck on getting me set up?? Pete"
      ],
      [
        "Gas can be found on www.ectho-webcl1.ect.enron.com.",
        "https://ecthou-webcl1.ect.enron.com/gas/"
      ],
      [
        "Pete said that he had told him at least 10 times.",
        "Sorry, He has told me that at least 10 times. Pete"
      ],
      [
        "Please call me, I am interested in the crib.",
        "I am interested in the crib , please give me a call. Pete"
      ]
    ],
    "target": [
      "From: lisa.yoho@enron.com",
      "From: mary.cook@enron.com",
      "From: e..dickson@enron.com",
      "From: chris.dorland@enron.com",
      "From: kim.theriot@enron.com"
    ]
  },
  "From: rhonda.denton@enron.com": {
    "test_samples": [
      [
        "The Master Energy Purchase and Sale Agreement is being assigned to Services, as a result of the merger between FirstEnergy Trading Services, Inc. and FirstEnergy Services Corp.",
        "FirstEnergy Trading Services, Inc. merged into FirstEnergy Services Corp. (Services) effective 12/31/2000. Notice has been given that they are assigning the Master Energy Purchase and Sale Agreement to Services."
      ],
      [
        "We have received the EEI Master Power Purchase and Sale Agreement from the referencedCP and it will be distributed to Legal and Credit.",
        "We have received the executed EEI Master Power Purchase and Sale Agreement dated 2/1/2001 from the referenced CP. Copies will be distributed to Legal and Credit."
      ],
      [
        "Both 519128 and 52530 were also included.",
        "also 519128 and 519230"
      ],
      [
        "The executed EEI Master Power Purchase and Sale Agreement has been given legal and credit.",
        "We received the executed EEI Master Power Purchase and Sale Agreement dated 4/6/2001. Copies have been given to legal and credit."
      ],
      [
        "I have agency letters that I have here.",
        "Here is what I have. They are agency letters."
      ]
    ],
    "val_samples": [
      [
        "There is everything that can be found from 5/1/01 onward.",
        "Here's everything that flows from 5/1/01 forward. Carol St Clair 05/25/2001 12:01 PM"
      ],
      [
        "The EEI agreements we have received are: Sempra Energy Trading Corp. and Dayton Power and Light Company.",
        "We have received the following executed EEI agreements: Sempra Energy Trading Corp. - 11/15/2000 Dayton Power and Light Company - 12/5/2000 Copies will be distributed to Legal and Credit."
      ],
      [
        "We would appreciate it if you could tell us if we will be receiving broker paper in Houston or Portland.",
        "FYI. Please let us know if we will be receiving broker paper in Houston or will it come to Portland?"
      ],
      [
        "You might not have access to those trades, so I bundled them to the west and east.",
        "Those are east trades and you probably don't have access to them. I just bundled west and east so you can ignore them. Kate Symes 01/30/2001 04:23 PM"
      ],
      [
        "The executed EEI Master Power Purchase and Sale Agreement has been received and will be distributed to legal and credit.",
        "We have received the executed EEI Master Power Purchase and Sale Agreement dated 3/15/2001 from the referenced CP. Copies will be distributed to legal and credit."
      ]
    ],
    "target": [
      "From: sylvia.hu@enron.com",
      "From: exchange.administrator@enron.com",
      "From: scott.stoness@enron.com",
      "From: anne.bike@enron.com",
      "From: jeff.duff@enron.com"
    ]
  },
  "From: richard.hrabal@enron.com": {
    "test_samples": [
      [
        "Your stomach needs to produce a new layer of mucus every two weeks if it's going to digest itself.",
        "Your stomach has to produce a new layer of mucus every two weeks otherwise it will digest itself."
      ],
      [
        "Didn't want to be the only one... Have fun... and don't want to be the only one.",
        "Have fun... didn't want to be the only one... LATE - test_1.exe"
      ],
      [
        "The production of Guinness beer takes a full seven percent of the entire Irish crop.",
        "A full seven percent of the entire Irish barley crop goes to the production of Guinness beer."
      ]
    ],
    "val_samples": [
      [
        "It is very nice to be open in private.",
        "OPEN IN PRIVATE. VERY VERY NICE - tteens01[1].mpeg"
      ],
      [
        "The tradition of armored knights raising their visors to identify themselves when they ride past their king has evolved into the modern military salute.",
        "Armored knights raised their visors to identify themselves when they rode past their king. This custom has become the modern military salute."
      ],
      [
        "The classreunionlm.jpg is open in private.",
        "OPEN IN PRIVATE > > - classreunionLM.jpg"
      ],
      [
        "Be careful and open in private. You can see it on all four screens.",
        "OPEN IN PRIVATE AND BE CAREFUL.... MINE OPENED UP ON ALL FOUR SCREENS.... YOUCH !!!!!! > > > - Sluts.pps"
      ]
    ],
    "target": [
      "From: margaret.carson@enron.com",
      "From: f..calger@enron.com",
      "From: aleck.dadson@enron.com",
      "From: e..dickson@enron.com",
      "From: jeffery.fawcett@enron.com"
    ]
  },
  "From: ricki.winters@enron.com": {
    "test_samples": [
      [
        "If you need assistance please call, I'll be in the office on December 20th, and will be back in the office on January 7th.",
        "I will be out of the office Thursday December 20th returning Monday January 7th. If you need immediate assistance please contact Ava Garcia at x35842. Thank you, Ricki"
      ],
      [
        "Ricki, I could only book 39C1 from 9:30 to 10:30.",
        "I could only book 39C1 from 9:30 until 10:30. Hope this helps, Ricki"
      ],
      [
        "I'm out of the office tomorrow and will be back on Monday. Thank you, Ricki.",
        "I will be out of the office tomorrow returning on Monday October 29th. If you need immediate assistance, please contact Ava Garcia at x35842. Thank you, Ricki"
      ],
      [
        "If you know of a way that she can start her staff meeting at 9:30 this morning, please let me know.",
        "Please make note that Shelley would like to start her staff meeting at 9:30 this morning instead of 9:00. Thank you, Ricki"
      ],
      [
        "pager (850) 985-5474.",
        "pager (850) 986-5646"
      ]
    ],
    "val_samples": [
      [
        "Brad and the other person are here, they are here, they are here, and they are here, and they are here, and they are here, and they are here, and they are here, and they are here, and they are here, and they are here, and they",
        "Brad & Gerry are here....."
      ],
      [
        "It will only be available tomorrow from 3:00 until 5:00, thanks to Ricki.",
        "Shelley will only be available tomorrow from 3:00 until 5:00. Thanks, Ricki"
      ],
      [
        "The direct report staff meeting on March 13th will need to be canceled, so you can release that time on your calendar.",
        "Shelley will need to cancel her direct report staff meeting on Wednesday March 13th at 9:00, so you can release that time on your calendar. Thank you, Ricki"
      ],
      [
        "Lunch is provided by Tammie Schoppe.",
        "Tammie Schoppe @ x34220 (lunch provided)"
      ],
      [
        "Thank you Ricki, I am sorry, but there will be a staff meeting at 11:00 this morning in ECN42C2.",
        "Please be advised Shelley will be canceling her Monday morning staff meeting at 11:00 this morning (10/22) in ECN42C2. Thank you, Ricki"
      ]
    ],
    "target": [
      "From: john.schwartzenburg@enron.com",
      "From: peter.keavey@enron.com",
      "From: scott.dieball@enron.com",
      "From: nony.flores@enron.com",
      "From: l..denton@enron.com"
    ]
  },
  "From: rob.walls@enron.com": {
    "test_samples": [
      [
        "What do you think about what's going on?",
        "what do you think?"
      ],
      [
        "They still have a sense of humor, at least that's what they say.",
        "at least they still have their sense of humor. . ."
      ],
      [
        "Who is talking to diomedes and will that person call him?",
        "who has been discussing this with diomedes? will that person call him?"
      ],
      [
        "Did you know if you had a chance to sign off on Justin's choice of Indian law firm?",
        "Did you by any chance sign off on Justin's choice of Indian law firm?"
      ],
      [
        "Let's make sure that we don'tmisunderstanding where EFI will come out on their claim.",
        "Mark - Let's discuss this so there is no misunderstanding about where EFI is likely to come out on their claim. Thanks. Rob"
      ]
    ],
    "val_samples": [
      [
        "Do you have your thoughts?",
        "your thoughts?"
      ],
      [
        "I don't know.",
        "fyi"
      ],
      [
        "Can we talk about this?",
        "can we chat about this?"
      ],
      [
        "Please call if you want to know about this policy.",
        "Please call re this policy. Thanks."
      ],
      [
        "Thanks a lot per our discussion.",
        "per our conversation. thanks guys."
      ]
    ],
    "target": [
      "From: jordan.mintz@enron.com",
      "From: bill.rapp@enron.com",
      "From: harry.woodson@enron.com",
      "From: steven.kean@enron.com",
      "From: janel.guerrero@enron.com"
    ]
  },
  "From: robert.hayes@enron.com": {
    "test_samples": [
      [
        "Why would they do that? I haven't visited with Stan in a while.",
        "why would they{nng guys} do that? I take it you haven't visited with Stan lately."
      ]
    ],
    "val_samples": [
      [
        "I wonder what's going on in the stock market this morning.",
        "Are you watching Kinder Morgan stock this morning? Wonder what's going on. Bob"
      ],
      [
        "I will let you know everything, if a little hint wouldn't kill you.",
        "Who's your buddy???????????????????????????? A little hint wouldn't kill you, would it? I tell you everything! BH"
      ],
      [
        "I hold our conversations in strict confidence and don't mind if you talk to me.",
        "Don't leave me hanging!!! What are you thinking? Any TW discussion? I always hold our conversations in strict confidence. Talk to me.............................................."
      ]
    ],
    "target": [
      "From: shanna.husser@enron.com",
      "From: jeff.duff@enron.com",
      "From: kathleen.carnahan@enron.com",
      "From: lisa.connolly@enron.com",
      "From: n..gray@enron.com"
    ]
  },
  "From: roger.yang@enron.com": {
    "test_samples": [
      [
        "I'm curious to hear what the solutions are for the crisis, and I'm hoping to hear what they have to say.",
        "I understand PG&E and SCE made some filings yesterday about solutions to their current crisis. I am anxious to hear what they are about and see what they said. Can we get those filings? Roger"
      ],
      [
        "We would like to see this one. \"Daniel Douglass\" Douglass@ ArterHadden.com> on 11/15/2000",
        "We want to see this one to. \"Daniel Douglass\" <Douglass@ArterHadden.com> on 11/15/2000 11:44:12 AM"
      ]
    ],
    "val_samples": [
      [
        "Can you include Ed, Joseph, and Tim in your CC list?",
        "Jeff, Can you please include Ed, Joseph, and Tim on your CC list. Thanks. Roger"
      ],
      [
        "If we can get it when they file, but not the workpapers, that's great.",
        "Have PG&E and SCE filed their latest ATCP filings? If so, can we get it? If not, can we get it when they do, including workpapers? Thanks Roger"
      ],
      [
        "The Courts won't address the California Electric Issues, that's right, and the Legislature could take direction from the Governor.",
        "It looks like the California Electric Issues will not be addressed in the Courts. This leaves the CPUC (President Lynch taking direction from the Governor) and potentially the Legislature. Roger"
      ]
    ],
    "target": [
      "From: gtownsend@manorisd.net",
      "From: amy.fitzpatrick@enron.com",
      "From: nony.flores@enron.com",
      "From: bryan.hull@enron.com",
      "From: l..denton@enron.com"
    ]
  },
  "From: rosalee.fleming@enron.com": {
    "test_samples": [
      [
        "I can't seem to open it! \"Charles E.\" \"Rahm, Charles E.\" Rahm@missouri.edu> on 09-11/2000 08:58:56 AM",
        "OOps, I can't seem to open it!! \"Rahm, Charles E.\" <Rahm@missouri.edu> on 09/11/2000 08:58:56 AM"
      ],
      [
        "Thanks, Rosie, these guys are going to get a lot of attention.",
        "Thanks, Debbie. These are lucky guys - they are going to have some undivided attention. Rosie Debbie Nowak 07/24/2000 03:02 PM"
      ],
      [
        "Hi Maria, I am aware that Mr. Lay did not receive his locker assignment.",
        "Hi Maria - To my knowledge, Mr. Lay has not received his locker assignment. Thanks. Rosalee Fleming for Ken Lay."
      ],
      [
        "The Globalist/Stephan Richter went live on March 22nd, 2001 at 12:11:56 PM.",
        "The Globalist/Stephan Richter <theglobalist@theglobalist.com> on 03/22/2001 12:11:56 PM"
      ],
      [
        "Go west on Woodway through two signals if you want to get to the reception in George Demontrond's home.",
        "Olympic Committee reception George Demontrond's home Dress: Business or Business Casual Go West on Woodway from the West Loop through two signals. Left on Pine Shadows."
      ]
    ],
    "val_samples": [
      [
        "\"Costamagna, Joe\", J Costamagna@Evolve.com>, thanked you, but no interest at this time.",
        "Thank you, but no interest at this time. \"Costamagna, Joe\" <JCostamagna@Evolve.com> on 04/12/2001 04:01:45 PM"
      ],
      [
        "The holiday gift from the Governor's staff was a thank you from Rosie.",
        "RYI - re: Executive Committee holiday gift. This is a thank you from Governor Ann Richards' staff. Rosie"
      ],
      [
        "The Allianceto SaveEnergy was sent by: owner-e-fficiencynews@crest.org.",
        "AlliancetoSaveEnergy@ase.org@crest.org on 03/26/2001 11:52:38 AM Sent by: owner-e-fficiencynews@crest.org"
      ],
      [
        "It worked, it was Keneth.lay@enron.com.",
        "Hi - it worked. It's kenneth.lay@enron.com. Michael Milken <mmilken@knowledgeu.com> on 02/28/2001 02:28:18 PM"
      ],
      [
        "This works well for Ken, thank you, Rebekah.",
        "Thank you, Rebekah. This works very well for Ken. Rosie Rebekah Rushing @ ENRON COMMUNICATIONS 09/19/2000 01:23 PM"
      ]
    ],
    "target": [
      "From: nony.flores@enron.com",
      "From: ricki.winters@enron.com",
      "From: david.parquet@enron.com",
      "From: steven.harris@enron.com",
      "From: jeff.duff@enron.com"
    ]
  },
  "From: sara.davidson@enron.com": {
    "test_samples": [
      [
        "If you received this memo previously, please disregard, the final memo has information regarding the Law Conference, Dinner and Activities.",
        "(If you previously received this memo, please disregard). Attached is the final memo with information regarding hotel accomodations, the Law Conference, Dinner and Activities. Look forward to seeing you in San Antonio! Sara"
      ],
      [
        "Yes, I will work with her to get you one.",
        "Yes, I will get with Becky Zikes and get her to send you one. Sara"
      ]
    ],
    "val_samples": [
      [
        "Please disregard the memo if you received it previously, it contains information regarding hotel accomodations, the law conference, dinner and activities.",
        "(If you previously received this memo, please disregard). Attached is the final memo with information regarding hotel accomodations, the Law Conference, Dinner and Activities. Look forward to seeing you in San Antonio! Sara"
      ],
      [
        "Andy Fastow wants me to contact all of the attorneys from Enron.",
        "Andy Fastow's office has requested that I forward to all Enron attorneys. = If you have any questions, please contact Andy Fastow."
      ]
    ],
    "target": [
      "From: john.schwartzenburg@enron.com",
      "From: bryan.hull@enron.com",
      "From: jeff.duff@enron.com",
      "From: legalonline-compliance@enron.com",
      "From: steven@iepa.com"
    ]
  },
  "From: sara.shackleton@enron.com": {
    "test_samples": [
      [
        "I'd like a copy of the Japanese materials. Sara, I guess you're aware that Mark was inquiring as to who had ordered these.",
        "I guess you know that Mark was inquiring as to who had ordered these. I'd like a copy of the Japanese materials. thanks. Sara"
      ],
      [
        "There were issues that were discussed at our July 2, 1999 meeting.",
        "Attached is an updated list of issues based upon our meeting of July 2, 1999."
      ],
      [
        "We need to make sure to follow up with Chuck Gilbert.",
        "Please follow up. Also, we need to follow up with Chuck Gilbert (counsel for CP) for docs. Thanks. Sara"
      ],
      [
        "Please look at the attached picture.",
        "Please see attached. SS"
      ],
      [
        "You do not need a defined term \"Agreement\" in the opening paragraph of your notice of exercise because it does not describe an option to extend.",
        "attached are comments (and note that you do not need the defined term \"Agreement\" in the opening paragraph: I do not understand your \"Notice of Exercise\" because it describes an option to extend. Please call."
      ]
    ],
    "val_samples": [
      [
        "David P Dupre asked, \"How about tomorrow at 10:00 am?\"",
        "How about tomorrow at 10:00 am? David P Dupre 11/02/99 12:46 PM"
      ],
      [
        "Neil, please call, I'm not sure if 54613 is your extension or not.",
        "Neil - please call me. Your extension is not 54613. Sara Raj would like to meet now."
      ],
      [
        "I thought there were at least 5 funds.",
        "I thought there were 5 funds. SS"
      ],
      [
        "Sara asks when the database will be ready for companywide access.",
        "Tana: When will the database be ready for companywide access? Sara"
      ],
      [
        "I'm not in the office until tomorrow afternoon.",
        "is out of the office until tomorrow afternoon. ss"
      ]
    ],
    "target": [
      "From: judy.townsend@enron.com",
      "From: christi.nicolay@enron.com",
      "From: a..shankman@enron.com",
      "From: anne.bike@enron.com",
      "From: k..heathman@enron.com"
    ]
  },
  "From: scott.dieball@enron.com": {
    "test_samples": [
      [
        "We're going to have a discussion with GE's tax advisors today. you're welcome to join us if you're able to.",
        "We've lined up a conf. call today at 1:30 CST re tax discussion with GE's and Enron's tax advisors. You are welcome to join in if your schedule permits."
      ]
    ],
    "val_samples": [
      [
        "You can see the comments in red.",
        "See comments in red below. Sheila Tweed@ECT 05/15/2001 04:22 PM"
      ],
      [
        "There's something to be said.",
        "FYI."
      ],
      [
        "It's nothing special from my end but I'm pretty sure that we'll get the call at the regular time.",
        "Nothing special from my end but I do expect that we will have the call at the regular time. Thanks. Suzanne Adams@ECT 06/04/2001 10:29 AM"
      ]
    ],
    "target": [
      "From: sue.nord@enron.com",
      "From: lorna.brennan@enron.com",
      "From: steven.harris@enron.com",
      "From: bryan.hull@enron.com",
      "From: jeffery.fawcett@enron.com"
    ]
  },
  "From: scott.stoness@enron.com": {
    "test_samples": [
      [
        "Pass code is 1 800 713 8600 and it is hosted by Scott Stoness.",
        "1 800 713 8600 Passcode = 68266 Host = Scott Stoness"
      ],
      [
        "The pin is six and the call is 800 713 8600.",
        "Call in number is 800 713 8600 Pin = 68266"
      ]
    ],
    "val_samples": [
      [
        "You must call 1 800 713 8600 if you wish to speak to a person.",
        "Call in # 1 800 713 8600 Pass=80435"
      ],
      [
        "There is a debate about how much of this presentation we can get into the comments to the governnor, given his requests outlined on page 14.",
        "This is the most recent version There is some debate about how much of this presentation we can get into the comments to the governnor given his requests outlined on page 14"
      ]
    ],
    "target": [
      "From: tori.kuykendall@enron.com",
      "From: archiving@enron.com",
      "From: lara.leibman@enron.com",
      "From: bradley.diebner@enron.com",
      "From: lisa.gang@enron.com"
    ]
  },
  "From: scott_gardner@pgn.com": {
    "test_samples": [
      [
        "Loss/Limit Notifications: None, Power Report 27.xls,Gas Report 27.xls and DPR 27.xls are attached.",
        "See attached Loss/Limit Notifications: None - DPR 27.xls - Power Report 27.xls - Gas Report 27.xls"
      ],
      [
        "There are no Loss/Limit Notifications for DPR 28.xls - Power Report and Gas Report.",
        "See attached Loss/Limit Notifications: None - DPR 28.xls - Power Report 28.xls - Gas Report 28.xls"
      ]
    ],
    "val_samples": [
      [
        "Loss/Limit Notifications: None. Power Report and Gas Report are attached.",
        "See attached Loss/Limit Notifications: None - DPR 26.xls - Power Report 26.xls - Gas Report 26.xls"
      ],
      [
        "Loss/Limit Notifications: None, Power Report, Gas Report, and DPR.",
        "See attached Loss/Limit Notifications: None - DPR 17.xls - Power Report 17.xls - Gas Report 17.xls"
      ],
      [
        "The attached reports include a Loss/Limit Notifications, a Power Report, and a Gas Report.",
        "See attached reports. Loss/Limit Notifications: None - DPR 20.xls - Power Report 20.xls - Gas Report 20.xls"
      ]
    ],
    "target": [
      "From: steven.kean@enron.com",
      "From: exchange.administrator@enron.com",
      "From: john.schwartzenburg@enron.com",
      "From: amy.copeland@enron.com",
      "From: larry.may@enron.com"
    ]
  },
  "From: shanna.funkhouser@enron.com": {
    "test_samples": [
      [
        "I will not be in the office tomorrow, so please call Dave Hill or pager if you are in need of assistance.",
        "I will be out of the office tomorrow on vacation. If you need immediate assistance, please contact Dave Hill at x34218 or pager: 888.847.2597. Thanks, Shanna"
      ]
    ],
    "val_samples": [
      [
        "Will do, you know what I mean.",
        "will do."
      ],
      [
        "The guy is a man by the name of Bogucki.",
        "Bogucki's guy."
      ],
      [
        "Thanks, Diane, can you give me a template for the search firm?",
        "Diane, Can you send me a template for the search firm MSA? Thanks, Shanna"
      ]
    ],
    "target": [
      "From: michael.brown@enron.com",
      "From: steven.harris@enron.com",
      "From: jennifer.thome@enron.com",
      "From: dan.leff@enron.com",
      "From: chris.dorland@enron.com"
    ]
  },
  "From: shanna.husser@enron.com": {
    "test_samples": [
      [
        "Mary, I'm working on putting the answers into the file, but I want to make sure that whoever takes this entity over has an electronic copy of all of the information.",
        "Mary- I am currently working on implementing these answers into the file- but I wanted you to have an electronic copy of all of this information also- so you can pass on to who ever takes this entity over. Shanna"
      ],
      [
        "Does any of you want to play? Sounds like a lot of fun.",
        "Do any of ya'll want to play? Sounds kind of like fun."
      ],
      [
        "It was nice to know that you both enjoy this one, with your comments on women drivers all the time.",
        "Thought you both would appreciate this one- with both of your \"women drivers\" comments all the time."
      ]
    ],
    "val_samples": [
      [
        "If you need anything else, let me know.",
        "Let me know if you need anything else. Shanna"
      ],
      [
        "The difference is on company 20R, not the other way around.",
        "Please note that I made a mistake in my first e-mail. The $5,577,900 difference is on company 20Q- not company 20R. Thanks- Shanna"
      ],
      [
        "I only got 6 correct.",
        "I only got 6 right?"
      ],
      [
        "Click to move on because there are a lot of them.",
        "Too cute!! There are a lot of them- just click to move on."
      ],
      [
        "Do you need to know who is going to dance with us Saturday night?",
        "Aren't you Mr. social? What you need to be asking is who is going dancing with us Saturday night? Eric Bass@ECT 11/17/2000 08:30 AM"
      ]
    ],
    "target": [
      "From: scott_gardner@pgn.com",
      "From: christi.nicolay@enron.com",
      "From: lisa.gang@enron.com",
      "From: kathleen.carnahan@enron.com",
      "From: jeff.duff@enron.com"
    ]
  },
  "From: steven.harris@enron.com": {
    "test_samples": [
      [
        "I don't know, I am waiting for the field to explain.",
        "I have no idea. It doesn't make sense and I am waiting for the field to explain."
      ],
      [
        "It's very important.",
        "FYI"
      ],
      [
        "It's not a big deal, but I'd like to.",
        "fyi"
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "This looks fine to me, Susan.",
        "Susan, this looks fine to me."
      ]
    ],
    "val_samples": [
      [
        "At the moment we don't need anything.",
        "We don't need anything at the moment."
      ],
      [
        "It sounds ok to me.",
        "Sounds ok to me."
      ],
      [
        "Isn't that nice?",
        "Yes. Isn't that nice!"
      ],
      [
        "Shouldn't we be talking to them about going off TW instead of waiting to find out who the supplier will be?",
        "Shouldn't we talk to them about sourcing off TW instead of waiting to see who the supplier will be? I would like to be as proactive as possible on this one. Thanks."
      ],
      [
        "I am interested in buying a Honda Magna 50, but I don't know where I could find it.",
        "Do you know where I could purchase a Honda Magna 50? I have never heard of nor seen them before. Thanks."
      ]
    ],
    "target": [
      "From: houston",
      "From: exchangeinfo@nymex.com",
      "From: j.harris@enron.com",
      "From: darren.vanek@enron.com",
      "From: sylvia.hu@enron.com"
    ]
  },
  "From: steven.kean@enron.com": {
    "test_samples": [
      [
        "The documents are here.",
        "Here are the documents."
      ],
      [
        "There is a calendar and a rsvp.",
        "calendar and rsvp"
      ],
      [
        "Thank you for the updated presentation. I need to keep up with you guys. Send more as you do them.",
        "Thanks for the updated presentation. It helps me a great deal to keep up with you guys. Send more as you do them."
      ],
      [
        "I agree, though I might have explained the context a bit differently to Ken.",
        "Thanks for the explanation. I agree, though I may not have explained the context adequately to Ken. Linda Robertson 05/11/2001 04:32 PM"
      ],
      [
        "Move Hebert meeting will be held on the 15th.",
        "Gretchen Bates/Mitchell Rosen (shared Marketing) 800-989-4427 Jim Coffey PEx use by marketers(312)407-7835 Move Hebert meeting from 15th"
      ]
    ],
    "val_samples": [
      [
        "If you don't get a reply by this time, please send it to Ken.",
        "Has this gone to Ken yet. If not please send. Maureen McVicker 06/21/2001 02:55 PM"
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "There was a request for fuel oil and no.6 by Diane Russell-Saunders.",
        "Diane Russell Saunders (Polaroid) RFP for fuel oil and no.6 (617) 386-7301"
      ],
      [
        "It's PerGeoff Roberts.",
        "Per Geoff Roberts"
      ],
      [
        "Ken wanted to keep David on until May 15 so he could finish some of the things he was working on for him.",
        "I talked with Ken yesterday. He would like to keep David on until May 15 to finish up some things he is working on for Ken. Enron Capital & Trade Resources Corp."
      ]
    ],
    "target": [
      "From: peter.keavey@enron.com",
      "From: darren.vanek@enron.com",
      "From: archiving@enron.com",
      "From: chris.dorland@enron.com",
      "From: brent.price@enron.com"
    ]
  },
  "From: steven@iepa.com": {
    "test_samples": [
      [
        "There's something to be said.",
        "FYI. -----"
      ],
      [
        "If you haven't already received this, please attach the attached file to provide feedback on the filing by COB on Wednesday.",
        "In case you did not receive this previously, attached is IEP's draft FERC Filing on Amendment No. 31. This filing is due Thursday. Please provide any comments by COB on Wednesday. Thanks. -----"
      ],
      [
        "I am sending back materials related to the Governor's executive orders due to the fact that some people weren't able to access the attachment.",
        "My understanding is some folks were unable to access the attachment.? Accordingly, I am resending these materials related to the Governor's executive orders. ? ? ?"
      ],
      [
        "To:? Is it a membership in the IeP?",
        "To:??? ??? IEP Membership"
      ]
    ],
    "val_samples": [
      [
        "There's a very interesting thing that I would like to tell you.",
        "FYI. -----"
      ],
      [
        "It's a word that rhymes with \"wobbly.\"",
        "-----"
      ],
      [
        "A memo from Andy Brown (Ellision and Schneider) summarizes the Governor's recent Executive Orders.",
        "Attached is a memo from Andy Brown (Ellision & Schneider) summarizing the Governor's recent Executive Orders. ?"
      ],
      [
        "The report is important to the membership, so it will be forwarded to the full membership in a separate email.",
        "Given the importance of the FERC California Report, IEP is forwarding it to the full membership. In a separate email, we will be noticing the FERC website where the report may be accessed. -----"
      ],
      [
        "If you didn't receive the final version, you can read the comments at theCPUC on the criteria for forward contracting.",
        "In case you did not receive the final version, here is the IEP Filed Comments at the CPUC on criteria for forward contracting. -----"
      ]
    ],
    "target": [
      "From: lorna.brennan@enron.com",
      "From: george.mcclellan@enron.com",
      "From: dan.bump@enron.com",
      "From: robert.hayes@enron.com",
      "From: donna.teal@enron.com"
    ]
  },
  "From: sue.nord@enron.com": {
    "test_samples": [
      [
        "It's great that you let people know that the work they do is appreciated. I think it's hard for everyone to remember that.",
        "This is very well done. It's great that you let people know that the work = they do is worthwhile and appreciated. Some days it's hard (for everyone, = I think) to remember that that is the case."
      ],
      [
        "The meeting was to discuss the legal, tax and regulatory considerations in obtaining a license to practice law in the state.",
        "Initial meeting to discuss commercial, legal, tax and regulatory considerations in obtaining CLEC licenses in the states."
      ],
      [
        "Is it 12 o'clock Central or 12 o'clock Eastern?",
        "Is this 12:00 Eastern or Central?"
      ],
      [
        "I think it's a good document to pass on to the larger group.",
        "I think this is a great document to circulate to the larger group. Thanks. Jeff Dasovich Sent by: Jeff Dasovich 01/03/2001 05:05 PM"
      ],
      [
        "Do you have the dial-in number to listen to the meeting?",
        "Do you have the dial-in number to listen to the FERC meeting?"
      ]
    ],
    "val_samples": [
      [
        "Do you want to have Ginger send this to the entire group so that we can get on with our lives?",
        "Do you want me to have Ginger send this to the whole group ASAP?"
      ],
      [
        "There's nothing to have a problem with.",
        "No problem."
      ],
      [
        "This is an excellent summary of the competition that took place in the local loop prepared by Kelley, Drye and Warren.",
        "This is an excellent summary of competition in the local loop prepared by Kelley, Drye and Warren. - KDWWhitePaper.doc"
      ],
      [
        "Director Government Affairs, Sue Nord, is located in Houston, Texas.",
        "Sue Nord, Sr. Director Government Affairs 713 345-4196"
      ],
      [
        "Sue Nord is the director of government affairs.",
        "fyi Sue Nord, Sr. Director Government Affairs 713 345-4196"
      ]
    ],
    "target": [
      "From: dan.bump@enron.com",
      "From: j.harris@enron.com",
      "From: lexi.elliott@enron.com",
      "From: ricki.winters@enron.com",
      "From: bryan.hull@enron.com"
    ]
  },
  "From: susan.mara@enron.com": {
    "test_samples": [
      [
        "We've been looking for this and it's here! Steve, I will let you know when you get the nfo from the ISO.",
        "Hey, this is what we've been looking for! Steve, let me knwo when you get the nfo from the ISO"
      ],
      [
        "Put more things in on a new proceeding when you worked on it a lot.",
        "Worked on it a lot -- put more stuff in on a new proceeding too"
      ],
      [
        "Sue Mara is the phone number for the Enron Corp.",
        "Sue Mara Enron Corp. Tel: (415) 782-7802 Fax:(415) 782-7854"
      ],
      [
        "SBX2 18 has legal status.",
        "Legal status of SBX2 18"
      ],
      [
        "I sent this to Sue Mara, and she can be contacted by fax at (415) 782-7854.",
        "I just sent this to you Sue Mara Enron Corp. Tel: (415) 782-7802 Fax:(415) 782-7854"
      ]
    ],
    "val_samples": [
      [
        "Call Sue Mara at 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846 888-666-1846",
        "Sue Mara Enron Corp. Tel: (415) 782-7802 Fax:(415) 782-7854"
      ],
      [
        "The firm that lobbies for Independent Energy Producer's is called Sue Mara and they are located in the city of San Francisco.",
        "From the Independent Energy Producer's lobbying firm Sue Mara Enron Corp. Tel: (415) 782-7802 Fax:(415) 782-7854"
      ],
      [
        "I am not sure what the order he was reading was.",
        "More rhetoric. I'm not too sure what FERC order he was reading. Sue Mara Enron Corp. Tel: (415) 782-7802 Fax:(415) 782-7854"
      ],
      [
        "There are changes to the distribution revenue requirement.",
        "Changes to the Distribution Revenue Requirement"
      ],
      [
        "Are we aware of who's behind this web site?",
        "Check out this web site http://www.electricityfact.com/ Do we know who's behind this?"
      ]
    ],
    "target": [
      "From: exchange.administrator@enron.com",
      "From: lisa.connolly@enron.com",
      "From: steven.kean@enron.com",
      "From: rosalee.fleming@enron.com",
      "From: rhonda.denton@enron.com"
    ]
  },
  "From: sylvia.hu@enron.com": {
    "test_samples": [
      [
        "The user iD is enronus, the user PW is bnaweb22.",
        "User iD: enronuslw PW: bnaweb22"
      ],
      [
        "Bnaweb22 is the user ID for enrondlr.",
        "User ID: enrondlr PW: bnaweb22"
      ],
      [
        "The user id is enronuslw.",
        "User ID: enronuslw PW: bnaweb22"
      ],
      [
        "The user is named Enronden and they have a user ID called bnaweb22.",
        "User ID: enronden PW: bnaweb22"
      ],
      [
        "The person with the user ID is enronccw.",
        "User ID: enronccw PW: bnaweb22"
      ]
    ],
    "val_samples": [
      [
        "The user is identified as enronuslw and it's called bnaweb22.",
        "User ID: enronuslw PW: bnaweb22"
      ],
      [
        "The user is named enrondlr and they have aPW of bnaweb22.",
        "User ID: enrondlr PW: bnaweb22"
      ],
      [
        "The library has a user ID of enron.",
        "User ID: enron PW: library"
      ],
      [
        "We have lots of seats for Lexis CertiFinder Training tomorrow and would be grateful if you would check out this new service.",
        "REMINDER We have plenty of seats for Lexis CertiFinder Training tomorrow. Please st= op=20 by to check out this new service if you are interested. Thanks, Sylvia Hu Corporate and Law Information Services =20"
      ],
      [
        "Bnaweb22 is the ID of enrondlr.",
        "ID: enrondlr PW: bnaweb22"
      ]
    ],
    "target": [
      "From: george.mcclellan@enron.com",
      "From: linda.noske@enron.com",
      "From: harry.woodson@enron.com",
      "From: exchangeinfo@nymex.com",
      "From: l..denton@enron.com"
    ]
  },
  "From: t..hodge@enron.com": {
    "test_samples": [
      [
        "Thanks, Mark, I am forwarding this for your response or delegation since it is a financial swap.",
        "Mark: I am forwarding this to you for your delegation or response since it is a financial swap. Thanks, Jeff"
      ],
      [
        "I will try to figure it out if you send me copies.",
        "Stacy: Please send me copies and I will see what I can figure out. Jeff"
      ],
      [
        "Is there anything specific that you need me to address during my trip to the UK in the week of November 5?",
        "Mark: My next trip to the UK is scheduled for the week of November 5. Is there anything specific you need me to address? Thanks, Jeff"
      ],
      [
        "The revision of the Gas Master includes the Collateral Annex. Sorry for the previous confusion.",
        "David: Pursuant to our discussion, attached is the revised Gas Master which includes the Collateral Annex as Exhibit D. Sorry for the previous confusion. Jeff"
      ],
      [
        "The information about the meeting I mentioned is here.",
        "Gerald: Here is information about the meeting I mentioned. Thanks, Jeff"
      ]
    ],
    "val_samples": [
      [
        "I sent the message from my phone at www.BlackBerry.net.",
        "EB3878a -------------------------- Sent from my BlackBerry Wireless Handheld (www.BlackBerry.net)"
      ],
      [
        "Jeff, that would be fine.",
        "Joanne, That would be fine. Jeff"
      ],
      [
        "Jeff, do you think Mark would let me leave this job to pursue this opportunity?",
        "Kay: For your information. Do you think Mark Haedicke would let me out of this job to pursue this opportunity? Jeff"
      ],
      [
        "Jeff: Sounds fine to me.",
        "Kay: Sounds fine to me. Jeff"
      ],
      [
        "Jeff: I want to help you, so let me know what I can do.",
        "Joel: Your approach sounds like a good one. Let me know what I can do to help. Jeff"
      ]
    ],
    "target": [
      "From: legalonline-compliance@enron.com",
      "From: amanda.rybarski@enron.com",
      "From: louis.dicarlo@enron.com",
      "From: tim.belden@enron.com",
      "From: jeff.duff@enron.com"
    ]
  },
  "From: taffy.milligan@enron.com": {
    "test_samples": [
      [
        "Please let me know if you have any changes to make.",
        "Good morning. Please let me know if you have any revisions to the attached. Taffy :)"
      ],
      [
        "If you can arrange for coverage for my desk on those days, please let me know.",
        "I will be out of the office Wednesday through Friday next week, 11/6-11/8. Brenda, Would you please arrange for coverage for my desk during those days? Thank you for your assistance. Taffy"
      ],
      [
        "THANK, YOU!",
        "tHANK YOU!"
      ],
      [
        "Susan Bailey needs to meet delivery people at home before she can return to her office.",
        "Susan Bailey had to meet delivery people at home. She should return to office by Noon."
      ],
      [
        "If anyone knows of where Martin Rosell is, please call his assistant, Suzanne.",
        "If anyone knows the wherebouts of Martin Rosell, Atty from Oslo. Please have him call his assistant, Suzanne immediately. Thanks."
      ]
    ],
    "val_samples": [
      [
        "Attached is advice and a note of apology.",
        "Sorry for the inconvenience. Please see attached and advise. tm"
      ],
      [
        "I'll be on vacation starting Monday, 8/7, and going through Friday, 8/12/. Sara Carrizal will be assigned to my desk.",
        "Please be advised, I will be on vacation beginning Monday, 8/7, through Friday, 8/11. Sara Carrizal will be assigned to my desk. Best regards, Taffy Milligan"
      ],
      [
        "Please check the attached calendar and let me know if there are any changes.",
        "Please review the attached calendar and advise of any revisions. Thank you, Taffy"
      ],
      [
        "Please reply to me right away, we have to know by Thursday a.m.",
        "Please send reply to ME, ASAP. We need info by Thursday a.m."
      ],
      [
        "There is a credit quiz.",
        "The credit worksheet"
      ]
    ],
    "target": [
      "From: e..dickson@enron.com",
      "From: larry.may@enron.com",
      "From: john.valdes@enron.com",
      "From: mark.palmer@enron.com",
      "From: jennifer.thome@enron.com"
    ]
  },
  "From: ted.evans@enron.com": {
    "test_samples": [
      [
        "J LO was at work last night.",
        "j LO WAS ON LAST NIGHT"
      ],
      [
        "I thought felicity was a good girl.",
        "i thought felicity was supposed to be a good girl??"
      ]
    ],
    "val_samples": [
      [
        "There's a story on Daily News about looks into ABC's secret.",
        "http://dailynews.yahoo.com/htx/bpihw/20011118/en/fcc_looks_into_abc_s_secret__1.html"
      ],
      [
        "CraigJeffers_Resume.doc, is a resume for Craig Jeffers.",
        "- Craig Jeffers_Resume.doc"
      ],
      [
        "Did you see your girl on tv last night?",
        "did you watch your girl on tv last night?"
      ]
    ],
    "target": [
      "From: paul.cherry@enron.com",
      "From: j.harris@enron.com",
      "From: lisa.connolly@enron.com",
      "From: e.taylor@enron.com",
      "From: jeff.duff@enron.com"
    ]
  },
  "From: ted.murphy@enron.com": {
    "test_samples": [
      [
        "It is Rick's first communication on this front and he is not sure what to make of it.",
        "Rick This is the first communication on this front. Not sure what to make of it. Any input would be appreciated Ted"
      ]
    ],
    "val_samples": [
      [
        "Sara Shackleton said that it was fine with her.",
        "That is fine with me Sara Shackleton 03/22/2000 09:09 AM"
      ],
      [
        "It would be hilarious if it weren't so close to the truth.",
        "It would be funny if it were not quite so close to the truth!"
      ],
      [
        "Let's not jump to conclusions about this.",
        "let's hold off on this."
      ]
    ],
    "target": [
      "From: jeffery.fawcett@enron.com",
      "From: lillian.villarreal@enron.com",
      "From: jennifer.thome@enron.com",
      "From: shanna.funkhouser@enron.com",
      "From: l..denton@enron.com"
    ]
  },
  "From: tim.belden@enron.com": {
    "test_samples": [
      [
        "There is a report showing when the new generation will be online in the next three years.",
        "one more report for your viewing pleasure. this shows when new generation will be coming online in the next three years."
      ],
      [
        "Let me know what you think of our proposal.",
        "here is our proposal. let me know your thoughts."
      ],
      [
        "Attached is a picture of the attached picture.",
        "see attached."
      ],
      [
        "We will provide an update at the meeting, which will be held at the same location as the last two floor meetings.",
        "Please plan to attend a floor meeting at 1 p.m. Chris and I will provide an update of current events. It will be held in the same location as the last two floor meetings."
      ],
      [
        "I am not sure what to make of it.",
        "fyi"
      ]
    ],
    "val_samples": [
      [
        "We are still working on the ice's butt.",
        "west volumes and eol trades look hopeful. we are still kicking ice's butt."
      ],
      [
        "Jackson is selling his soul to the devil.",
        "Jackson sells his soul to the devil!"
      ],
      [
        "It has been hanging out there for about a week so please tell me if it needs to be changed or approved.",
        "I think it's in John's court. Please advise as to whether it will be approved or needs to be changed. It's been hanging out there for about a week. Thanks."
      ],
      [
        "I don't know if that's true or not, but I think it's true. I want to know if that's true or not, but I think it's true.",
        "fyi."
      ],
      [
        "Let everyone know what's going on by checking this out.",
        "check this out and let everyone know what's up."
      ]
    ],
    "target": [
      "From: john.valdes@enron.com",
      "From: michael.brown@enron.com",
      "From: larry.may@enron.com",
      "From: a..shankman@enron.com",
      "From: sara.davidson@enron.com"
    ]
  },
  "From: tori.kuykendall@enron.com": {
    "test_samples": [
      [
        "Are you still using instant messenger at work?",
        "do you not have instant messenger at work anymore??"
      ],
      [
        "Thanks a lot.",
        "thanks"
      ],
      [
        "I guess the best thing to do is follow the advice of the experts, and hopefully we'll win in the long run.",
        "sounds like a good plan -- i guess the best thing to do is follow advice of the experts -- hopefully we will win in the long run"
      ],
      [
        "Happy New Year, here you go!",
        "Here you go! Happy New Year!"
      ],
      [
        "Thanks again, Chris, I wanted to make a couple more changes on the resume, but I had someone look at it, so I will forward this evening.",
        "Hi Chris -- wanted to make a couple more changes on the resume after having someone review it -- will forward this evening. Thanks again."
      ]
    ],
    "val_samples": [
      [
        "If I do not get fiedler, I will be willing to bid 5 points for charlie and 25 points for jason brookins.",
        "i also would bid 5 points for charlie batch if i dont get fiedler -- i also want to bid 25 points for jason brookins"
      ],
      [
        "I would like to receive a swatch of Seaside Baby.",
        "I'd like a swatch of Seaside Baby. My mailing address is 4419 Stackstone Ln. Katy, TX 77450"
      ],
      [
        "I left you a message on your cell phone and you didn't want to talk to me, so I'm giving you a chance to call me.",
        "hello - i left you a message on your cell phone a month ago - I thought you decided that you didnt want to talk to me or something. CALL ME -- 713-853-3275."
      ],
      [
        "We're going to chip in for the keg. Lets see if it's a go.",
        "we will chip in for the keg. let me know if it's a go."
      ],
      [
        "We'll be going to dinner after that and I'll do my best to stay out after that, but I apologize for taking so long to get back to you, I don't know how long we'll stay out after that.",
        "hey heath -- sorry it took so long to get back to you -- we plan on at least going to dinner -- dont know how long we'll stay out after that -- i'll do my best. See you there."
      ]
    ],
    "target": [
      "From: rosalee.fleming@enron.com",
      "From: larry.may@enron.com",
      "From: e..dickson@enron.com",
      "From: mark.palmer@enron.com",
      "From: robert.hayes@enron.com"
    ]
  },
  "From: wanda.curry@enron.com": {
    "test_samples": [
      [
        "Do you know whether the surcharge of 3 cent and 1 cent will not apply to direct access loads?",
        "WOW! This is really a surprise. Does this mean the current surcharge of 3 cent and 1 cent will NOT apply to direct access loads? You would really make our day if your answer is yes. Wanda"
      ],
      [
        "Please call my number if you have questions, I'm in the conference room and the number 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519 800-211-2519",
        "Mr. Dasovich, The call in number to the conference room is 713-345-7386. Please call if you have any questions, my number is 713-853-0402. Thank you, AC Romero"
      ],
      [
        "Please let me know what you think of the draft.",
        "Here is my first pass draft. Please let me know your comments."
      ]
    ],
    "val_samples": [
      [
        "I'll be available for this call.",
        "I will be available for this call. Wanda"
      ],
      [
        "You are correct, but Jeff was quicker to point out my error.",
        "You are right, but Jeff was much quicker to point out my error. Might I be distracted by everything going on around me?? Wanda"
      ],
      [
        "Sally, I would be happy to discuss with you how you could help the gas desk.",
        "Sally, Thought this might be something you could offer to help the gas desk with. They currently handle all the logistics for gas and power. Call me if you would like to discuss. Wanda"
      ],
      [
        "Wanda Curry, thanks for taking time to keep us up to date, it has been great to have you participate on the morning call.",
        "It has been great to have you participate on the morning call. Thanks for taking the time to keep us all up to date. Thanks, Wanda Curry"
      ],
      [
        "I want to know if you can find a location for the meeting in case the people in the building don't like to meet in one place.",
        "Scott, This is the call information. Can you please have you assistant find a location for the meeting in case the attendees in the Enron Building would like to convene in one place. Thanks, Wanda"
      ]
    ],
    "target": [
      "From: monika.causholli@enron.com",
      "From: john.schwartzenburg@enron.com",
      "From: ted.evans@enron.com",
      "From: ricki.winters@enron.com",
      "From: george.mcclellan@enron.com"
    ]
  },
  "From: wes.colwell@enron.com": {
    "test_samples": [
      [
        "We're going to make it happen.",
        "You're done on this. We will make the acctg happen. Wes"
      ]
    ],
    "val_samples": [
      [
        "You would like periodic updates, but these guys are starting to take ownership of the project, which is a good thing.",
        "FYI. Contract analysis is beginning to proceed. Just though you would want periodic updates, but these guys are beginning to take ownership which is a good thing. Wes"
      ],
      [
        "That's correct.",
        "FYI"
      ],
      [
        "We'll look into it if you know about it.",
        "Did you know this? We will look into it. Wes"
      ]
    ],
    "target": [
      "From: david.parquet@enron.com",
      "From: janel.guerrero@enron.com",
      "From: larry.may@enron.com",
      "From: archiving@enron.com",
      "From: horton@enron.com"
    ]
  },
  "From: zakiyyah.mcclure@enron.com": {
    "test_samples": [
      [
        "We can do this by phone if you want. I spoke to Kori on Friday, but he didn't reply.",
        "we can do this by phone if you like. I called Kori as well on Friday, no response. I am attempting to confirm the number of positions in these books. Zakiyyah xt 58146"
      ],
      [
        "Please send conversion factors for each of the curves.",
        "Please provide conversion factors for each of these curves. Please resend upon completion. Zakiyyah xt 58146"
      ]
    ],
    "val_samples": [
      [
        "When will there be positions in this book?",
        "As well, when will positions be in this book?"
      ],
      [
        "Zakiyyah McClure Risk is with us today for our morning meeting.",
        "For our morning meeting. Zakiyyah McClure Risk Analytics xt 58146"
      ],
      [
        "Thank you very much Zakiyyah, please disregard the email, it was sent to you error.",
        "Mr. Shankman, This email was sent to you error. Please disregard. Thank you kindly. Zakiyyah McClure xt 58146"
      ],
      [
        "I can't attend because I don't have 2 tickets.",
        "DOES ANYONE NEED 2 TICKETS ???? I CANT ATTEND. PLS CALL ME AT X58146"
      ]
    ],
    "target": [
      "From: ted.murphy@enron.com",
      "From: carlos.alatorre@enron.com",
      "From: steven.kean@enron.com",
      "From: john.forney@enron.com",
      "From: paula.rieker@enron.com"
    ]
  }
}